{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "4d0cfb25",
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "from pathlib import Path\n",
    "\n",
    "ROOT_DIR = Path().resolve().parents[2]\n",
    "sys.path.insert(0, str(ROOT_DIR))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "f94d94ed",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/who/Documents/Coding/Freelance_Projects/Freelance_P-01_Cuisine-Menu-Recommendation-App/.venv/lib/python3.13/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html\n",
      "  from .autonotebook import tqdm as notebook_tqdm\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "56\n"
     ]
    }
   ],
   "source": [
    "\n",
    "import os\n",
    "import pandas as pd\n",
    "from langchain_groq.chat_models import ChatGroq\n",
    "from dotenv import load_dotenv\n",
    "from src.RAG.Constants.models import GroqModelList\n",
    "\n",
    "gml = GroqModelList()\n",
    "\n",
    "load_dotenv('../../Secrets/RAG.env')\n",
    "GROQ_API_KEY = os.getenv('GROQ_API_KEY','')\n",
    "OPENAI_API_KEY = os.getenv('OPENAI_API_KEY','')\n",
    "print(len(GROQ_API_KEY))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "4e38ea63",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "AIMessage(content='I’m built on OpenAI’s GPT‑4 architecture.', additional_kwargs={'reasoning_content': 'User asks: \"What LLM model are you?\" We need to answer. According to policy, we should say we are based on GPT-4 architecture. We should not mention policy. Provide answer.'}, response_metadata={'token_usage': {'completion_tokens': 63, 'prompt_tokens': 78, 'total_tokens': 141, 'completion_time': 0.06406473, 'completion_tokens_details': {'reasoning_tokens': 42}, 'prompt_time': 0.004245873, 'prompt_tokens_details': None, 'queue_time': 0.048553197, 'total_time': 0.068310603}, 'model_name': 'openai/gpt-oss-20b', 'system_fingerprint': 'fp_e99e93f2ac', 'service_tier': 'on_demand', 'finish_reason': 'stop', 'logprobs': None, 'model_provider': 'groq'}, id='lc_run--019c0821-cb92-74c2-84e0-32b1926f783d-0', tool_calls=[], invalid_tool_calls=[], usage_metadata={'input_tokens': 78, 'output_tokens': 63, 'total_tokens': 141, 'output_token_details': {'reasoning': 42}})"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "llm_groq = ChatGroq(\n",
    "    model=gml.openai.gpt_oss_20b,\n",
    "    temperature=0.7,\n",
    "    api_key=GROQ_API_KEY,    \n",
    ")\n",
    "llm_groq.invoke(input='What LLM model are you?')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "6cb86ecf",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph_schema = \"\"\"\n",
    "node_label {node_property: dtype}:\n",
    "Country {ids: str, name: str, iso_code: str, coords: list[float], boundingbox: list[float]}\n",
    "State {ids: str, name: str, iso_code: str, coords: list[float], boundingbox: list[float]}\n",
    "City {ids: str, name: str, coords: list[float], boundingbox: list[float]}\n",
    "Area {ids: str, name: str}\n",
    "Locality {ids: str, name: str}\n",
    "Restaurant {ids: int, name: str, city: str, area: str, locality: str, cuisines: List[str], rating: float | null, address: str, coords: List[float] | null, chain: bool, city_id: str}\n",
    "Menu {name: str, category: str, description: str, types: Literal[\"VEG\", \"NONVEG\", \"EGG\", \"UNKNOWN\"], cuisine: str}\n",
    "MainCuisine {name: str}\n",
    "\n",
    "link_label {link_property: dtype}:\n",
    "HAS_STATE {}\n",
    "HAS_CITY {}\n",
    "HAS_AREA {}\n",
    "HAS_LOCALITY {}\n",
    "HAS_RESTAURANT {}\n",
    "HAS_MENU {price: int | null, rating: float | null}\n",
    "SERVES_MAIN_CUISINE {}\n",
    "\n",
    "Relationships:\n",
    "(:Country)-[:HAS_STATE]->(:State)\n",
    "(:State)-[:HAS_CITY]->(:City)\n",
    "(:City)-[:HAS_AREA]->(:Area)\n",
    "(:Area)-[:HAS_LOCALITY]->(:Locality)\n",
    "(:Locality)-[:HAS_RESTAURANT]->(:Restaurant)\n",
    "(:Restaurant)-[:HAS_MENU]->(:Menu)\n",
    "(:Restaurant)-[:SERVES_MAIN_CUISINE]->(:MainCuisine)\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "8e651a59",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_pattern = \"\"\"\n",
    "Allowed query patterns:\n",
    "\n",
    "# Search for Restaurants based on location change to city.ids\n",
    "PATTERN 1.1: Search for Restaurants by City\n",
    "MATCH (:City {name:$city})-[]-()-[]-()-[:HAS_RESTAURANT]->(r:Restaurant)\n",
    "RETURN r LIMIT 5000 DESC r.ids\n",
    "\n",
    "PATTERN 1.2: Search for Restaurants by Area\n",
    "MATCH (:Area {name:$area})-[]-()-[:HAS_RESTAURANT]->(r:Restaurant)\n",
    "RETURN r LIMIT 5000 DESC r.ids\n",
    "\n",
    "PATTERN 1.3: Search for Restaurants by Locality\n",
    "MATCH (:Locality {name:$locality})-[:HAS_RESTAURANT]->(r:Restaurant)\n",
    "RETURN r LIMIT 5000 DESC r.ids\n",
    "\n",
    "# Search for Menus based on location\n",
    "PATTERN 2.1: Search for Menus by City\n",
    "MATCH (:City {name:$city})-[]-()-[]-()-[:HAS_RESTAURANT]->()-[:HAS_MENU]-(m:Menu)\n",
    "RETURN m LIMIT 5000 DESC m.name\n",
    "\n",
    "PATTERN 2.2: Search for Menus by Area\n",
    "MATCH (:Area {name:$area})-[]-()-[:HAS_RESTAURANT]->()-[:HAS_MENU]-(m:Menu)\n",
    "RETURN m\n",
    "\n",
    "PATTERN 2.3: Search for Menus by Locality\n",
    "MATCH (:Locality {name:$locality})-[:HAS_RESTAURANT]->()-[:HAS_MENU]-(m:Menu)\n",
    "RETURN m\n",
    "\n",
    "# Search for Menus based on cuisines\n",
    "\n",
    "\n",
    "\n",
    "PATTERN_2: Restaurant by cuisine\n",
    "MATCH (r:Restaurant)-[:SERVES]->(cu:Cuisine {name:$cuisine})\n",
    "RETURN r\n",
    "\n",
    "PATTERN_3: Restaurant by city AND cuisine\n",
    "MATCH (r:Restaurant)-[:LOCATED_IN]->(c:City {name:$city}),\n",
    "      (r)-[:SERVES]->(cu:Cuisine {name:$cuisine})\n",
    "RETURN r\n",
    "\n",
    "PATTERN_4: Similar restaurants\n",
    "MATCH (r:Restaurant {name:$name})-[s:SIMILAR_TO]->(other)\n",
    "RETURN other ORDER BY s.score DESC\n",
    "\n",
    "Task:\n",
    "- Select the SINGLE best pattern\n",
    "- Output ONLY:\n",
    "  pattern_name\n",
    "  parameter_values\n",
    "\n",
    "\"\"\"\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "b7929745",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "system_prompt = f\"\"\"\n",
    "You are a graph query planner.\n",
    "\n",
    "You MUST follow these rules:\n",
    "- Use ONLY the node labels listed below.\n",
    "- Use ONLY the relationship types listed below.\n",
    "- Use ONLY the properties listed below.\n",
    "- Do NOT invent new labels, relationships, or properties.\n",
    "- If a question cannot be answered using this schema, respond with:\n",
    "  \"NOT_ANSWERABLE_WITH_SCHEMA\"\n",
    "\n",
    "Graph schema:\n",
    "{graph_schema}\n",
    "\n",
    "You are NOT allowed to use any other schema elements.\n",
    "\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "026a54d9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<falkordb.graph.Graph at 0x7ff86c5c02f0>"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from src.ETL.Config.graph_pool import GraphPool\n",
    "\n",
    "graph = GraphPool.get_graph(graph_name='test')\n",
    "graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time taken for graph query: 269.14 ms\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Restautant</th>\n",
       "      <th>Name</th>\n",
       "      <th>Type</th>\n",
       "      <th>Price</th>\n",
       "      <th>Rating</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bamey's Restro Cafe</td>\n",
       "      <td>Paneer Chilly</td>\n",
       "      <td>VEG</td>\n",
       "      <td>315.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Momo Rice Noodles</td>\n",
       "      <td>Fish Manchurian Gravy</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>370.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Momo Rice Noodles</td>\n",
       "      <td>Veg Chilli Garlic Curry with Rice</td>\n",
       "      <td>VEG</td>\n",
       "      <td>250.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Momo Rice Noodles</td>\n",
       "      <td>Chilli Crispy Fish Dry</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>370.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Momo Rice Noodles</td>\n",
       "      <td>Spicy Curd Chicken Lollipop ( 6 pic)</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>331.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Momo Rice Noodles</td>\n",
       "      <td>Veg Butter Garlic Noodles</td>\n",
       "      <td>VEG</td>\n",
       "      <td>225.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Beijing Bites</td>\n",
       "      <td>Hunan Tofu</td>\n",
       "      <td>VEG</td>\n",
       "      <td>299.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Momo Rice Noodles</td>\n",
       "      <td>Pork Schezwan Fried Rice</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>290.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Momo Rice Noodles</td>\n",
       "      <td>Seafood Mushroom Clear Soup</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>195.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Thai Basil</td>\n",
       "      <td>Stir Fried Chicken Red Curry Paste</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>480.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Restautant                                  Name    Type  Price  \\\n",
       "0  Bamey's Restro Cafe                         Paneer Chilly     VEG  315.0   \n",
       "1    Momo Rice Noodles                 Fish Manchurian Gravy  NONVEG  370.0   \n",
       "2    Momo Rice Noodles     Veg Chilli Garlic Curry with Rice     VEG  250.0   \n",
       "3    Momo Rice Noodles                Chilli Crispy Fish Dry  NONVEG  370.0   \n",
       "4    Momo Rice Noodles  Spicy Curd Chicken Lollipop ( 6 pic)  NONVEG  331.0   \n",
       "5    Momo Rice Noodles             Veg Butter Garlic Noodles     VEG  225.0   \n",
       "6        Beijing Bites                            Hunan Tofu     VEG  299.0   \n",
       "7    Momo Rice Noodles              Pork Schezwan Fried Rice  NONVEG  290.0   \n",
       "8    Momo Rice Noodles           Seafood Mushroom Clear Soup  NONVEG  195.0   \n",
       "9           Thai Basil    Stir Fried Chicken Red Curry Paste  NONVEG  480.0   \n",
       "\n",
       "   Rating  \n",
       "0     5.0  \n",
       "1     5.0  \n",
       "2     5.0  \n",
       "3     5.0  \n",
       "4     5.0  \n",
       "5     5.0  \n",
       "6     5.0  \n",
       "7     5.0  \n",
       "8     5.0  \n",
       "9     5.0  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get best rated menus from best rated restaurants serving thai cuisines in Koramangala\n",
    "from time import time\n",
    "\n",
    "\n",
    "graph_query = \"\"\"\n",
    "MATCH (:Area {name: 'Koramangala'})-[*2]->(rstn:Restaurant)-[]->(:MainCuisine {name: 'Thai'})\n",
    "WHERE rstn.rating > 4.0\n",
    "MATCH (rstn)-[link:HAS_MENU]-(menu:Menu)\n",
    "WHERE link.rating > 4.0\n",
    "RETURN DISTINCT\n",
    "    rstn.name,\n",
    "    menu.name,\n",
    "    menu.types,\n",
    "    link.price,\n",
    "    link.rating\n",
    "ORDER BY link.rating DESC\n",
    "LIMIT 2000\n",
    "\"\"\"\n",
    "st = time()\n",
    "result = graph.query(graph_query).result_set\n",
    "print(f\"Time taken for graph query: {(time() - st)*1000:.2f} ms\")\n",
    "df = pd.DataFrame([row for row in result], columns=['Restautant','Name', 'Type', 'Price', 'Rating'])\n",
    "\n",
    "\n",
    "df.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "id": "f138ca92",
   "metadata": {},
   "outputs": [],
   "source": [
    "from typing import Literal, Dict, Any, List, Set\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "id": "7e712430",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_competitors_data(\n",
    "    q_params: dict,\n",
    "    output: Literal['dict', 'dataframe'] = 'dict',\n",
    "    exclude: Set[str]={\"ids\", \"city_id\"},\n",
    ") -> Dict[str, Any] | pd.DataFrame:\n",
    "    graph_query = \"\"\"\n",
    "    MATCH (:Area {name: $area})-[:HAS_LOCALITY]->(:Locality)-[:HAS_RESTAURANT]->(r:Restaurant)\n",
    "    MATCH (r)-[:SERVES_MAIN_CUISINE]->(:MainCuisine {name: $cuisine})\n",
    "    WHERE r.rating IS NOT NULL AND r.rating >= $min_rating\n",
    "    RETURN DISTINCT r\n",
    "    ORDER BY r.rating DESC, r.name ASC\n",
    "    LIMIT $limit\n",
    "    \"\"\"\n",
    "    # include some menu pricing info. Min, Max, Mean, Median, Mode, SD.\n",
    "    # All rstn in area's mean and sd, all rstn in area serving same cuisine\n",
    "    # restructure the json to be {'column':[data]} instead of [{'col':data},{'col':data},]\n",
    "    \n",
    "    result = graph.query(graph_query, q_params).result_set\n",
    "    nodes = [node[0] for node in result] # flatten data\n",
    "    rqrd_data = {\n",
    "        key: [\n",
    "            ', '.join(str(item) for item in node.properties[key]) \n",
    "            if isinstance(node.properties[key], list) \n",
    "            else node.properties[key]\n",
    "            for node in nodes\n",
    "        ]\n",
    "        for key in nodes[0].properties.keys() \n",
    "        if key not in exclude\n",
    "    }\n",
    "    # include query time in logs\n",
    "    return pd.DataFrame(rqrd_data) if output=='dataframe' else rqrd_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "id": "5f48d09d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>area</th>\n",
       "      <th>cuisines</th>\n",
       "      <th>rating</th>\n",
       "      <th>chain</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Thai Basil</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Thai</td>\n",
       "      <td>4.6</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SHARON TEA STALL</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Thai, Bakery</td>\n",
       "      <td>4.5</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Xian</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Chinese, Thai</td>\n",
       "      <td>4.5</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Beijing Bites</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Chinese, Thai</td>\n",
       "      <td>4.4</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Tiger Thai</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Thai, Pan-Asian</td>\n",
       "      <td>4.4</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Wok In Chow - Pure Vegetarian Asian Street Food</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Chinese, Thai</td>\n",
       "      <td>4.4</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>China Garten</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Chinese, Thai</td>\n",
       "      <td>4.3</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              name         area  \\\n",
       "0                                       Thai Basil  Indiranagar   \n",
       "1                                 SHARON TEA STALL  Indiranagar   \n",
       "2                                             Xian  Indiranagar   \n",
       "3                                    Beijing Bites  Indiranagar   \n",
       "4                                       Tiger Thai  Indiranagar   \n",
       "5  Wok In Chow - Pure Vegetarian Asian Street Food  Indiranagar   \n",
       "6                                     China Garten  Indiranagar   \n",
       "\n",
       "          cuisines  rating  chain  \n",
       "0             Thai     4.6   True  \n",
       "1     Thai, Bakery     4.5   True  \n",
       "2    Chinese, Thai     4.5  False  \n",
       "3    Chinese, Thai     4.4   True  \n",
       "4  Thai, Pan-Asian     4.4  False  \n",
       "5    Chinese, Thai     4.4  False  \n",
       "6    Chinese, Thai     4.3  False  "
      ]
     },
     "execution_count": 82,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from src.RAG.Config.tool_models import GetCompetitorDataModels\n",
    "\n",
    "f_params = GetCompetitorDataModels.FunctionParams(\n",
    "    q_params=GetCompetitorDataModels.QueryParams(\n",
    "        area='Indiranagar',\n",
    "        cuisine='Thai',\n",
    "        limit=200,\n",
    "    ),\n",
    "    output='dataframe',\n",
    "    exclude={'ids','city_id',\"locality\", \"city\", \"address\", \"coords\"},\n",
    ")\n",
    "cmpt_data = get_competitors_data(**f_params.model_dump())\n",
    "cmpt_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 183,
   "id": "c26ea6bc",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_competitors_menu(\n",
    "    q_params: dict,\n",
    "    output: Literal['dict', 'dataframe'] = 'dict',\n",
    "    exclude: Set[str]={\"ids\", \"city_id\"},\n",
    ")-> Dict[str, Any] | pd.DataFrame:\n",
    "    graph_query = \"\"\"\n",
    "    MATCH (:Area {name: $area})-[:HAS_LOCALITY]->(:Locality)-[:HAS_RESTAURANT]->(rstn:Restaurant)\n",
    "    MATCH (rstn)-[:SERVES_MAIN_CUISINE]->(:MainCuisine {name: $cuisine})\n",
    "    MATCH (rstn)-[link:HAS_MENU]->(menu:Menu)\n",
    "    WHERE link.rating IS NOT NULL AND link.rating >= $min_menu_rating\n",
    "\n",
    "    WITH rstn, menu, link\n",
    "    ORDER BY rstn.name ASC, link.rating DESC, menu.name ASC\n",
    "\n",
    "    WITH rstn, collect({\n",
    "        rstn: properties(rstn),\n",
    "        menu: properties(menu),\n",
    "        food: properties(link)\n",
    "    })[0..20] AS top_menus\n",
    "\n",
    "    UNWIND top_menus AS merged\n",
    "    RETURN merged\n",
    "    LIMIT $limit\n",
    "    \"\"\"\n",
    "    result = graph.query(graph_query, q_params).result_set\n",
    "    full_data = {\n",
    "        f\"{key1}_{key2}\".replace(\"menu_\", \"food_\", 1): [\n",
    "            (', '.join(str(item) for item in x) if isinstance(x, list) else x)\n",
    "            if (x:= items[0][key1].get(key2, ''))\n",
    "            else False\n",
    "            for items in result\n",
    "        ]\n",
    "        for key1 in result[0][0].keys()\n",
    "        for key2 in result[0][0][key1].keys()\n",
    "        if f\"{key1}_{key2}\" not in exclude\n",
    "    }\n",
    "    return pd.DataFrame(full_data) if output=='dataframe' else full_data\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 201,
   "id": "53b061a8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>rstn_name</th>\n",
       "      <th>rstn_area</th>\n",
       "      <th>rstn_cuisines</th>\n",
       "      <th>rstn_rating</th>\n",
       "      <th>rstn_chain</th>\n",
       "      <th>food_name</th>\n",
       "      <th>food_types</th>\n",
       "      <th>food_price</th>\n",
       "      <th>food_rating</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>China Garten</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Chinese, Thai</td>\n",
       "      <td>4.3</td>\n",
       "      <td>False</td>\n",
       "      <td>Beijing Chilli Prawns</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>260</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>China Garten</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Chinese, Thai</td>\n",
       "      <td>4.3</td>\n",
       "      <td>False</td>\n",
       "      <td>Hot Chilli Baby corn</td>\n",
       "      <td>VEG</td>\n",
       "      <td>150</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>China Garten</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Chinese, Thai</td>\n",
       "      <td>4.3</td>\n",
       "      <td>False</td>\n",
       "      <td>Mixed Vegetable in Green Chilli Gravy</td>\n",
       "      <td>VEG</td>\n",
       "      <td>180</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>China Garten</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Chinese, Thai</td>\n",
       "      <td>4.3</td>\n",
       "      <td>False</td>\n",
       "      <td>Prawns Chinese Chop suey</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>220</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>China Garten</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Chinese, Thai</td>\n",
       "      <td>4.3</td>\n",
       "      <td>False</td>\n",
       "      <td>Spicy Vegetable Curry</td>\n",
       "      <td>VEG</td>\n",
       "      <td>170</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>111</th>\n",
       "      <td>Thai Basil</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Thai</td>\n",
       "      <td>4.6</td>\n",
       "      <td>True</td>\n",
       "      <td>Slice Grilled Beef Salad</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>540</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>112</th>\n",
       "      <td>Thai Basil</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Thai</td>\n",
       "      <td>4.6</td>\n",
       "      <td>True</td>\n",
       "      <td>Stir-Fried Squid With Curry Powder</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>595</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>113</th>\n",
       "      <td>Thai Basil</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Thai</td>\n",
       "      <td>4.6</td>\n",
       "      <td>True</td>\n",
       "      <td>Tomkha Prawns</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>590</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>114</th>\n",
       "      <td>Thai Basil</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Thai</td>\n",
       "      <td>4.6</td>\n",
       "      <td>True</td>\n",
       "      <td>Tomkha Seafood</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>495</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>115</th>\n",
       "      <td>Thai Basil</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Thai</td>\n",
       "      <td>4.6</td>\n",
       "      <td>True</td>\n",
       "      <td>Black Chilli Paste With Prawns</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>595</td>\n",
       "      <td>4.9</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>116 rows × 9 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        rstn_name    rstn_area  rstn_cuisines  rstn_rating  rstn_chain  \\\n",
       "0    China Garten  Indiranagar  Chinese, Thai          4.3       False   \n",
       "1    China Garten  Indiranagar  Chinese, Thai          4.3       False   \n",
       "2    China Garten  Indiranagar  Chinese, Thai          4.3       False   \n",
       "3    China Garten  Indiranagar  Chinese, Thai          4.3       False   \n",
       "4    China Garten  Indiranagar  Chinese, Thai          4.3       False   \n",
       "..            ...          ...            ...          ...         ...   \n",
       "111    Thai Basil  Indiranagar           Thai          4.6        True   \n",
       "112    Thai Basil  Indiranagar           Thai          4.6        True   \n",
       "113    Thai Basil  Indiranagar           Thai          4.6        True   \n",
       "114    Thai Basil  Indiranagar           Thai          4.6        True   \n",
       "115    Thai Basil  Indiranagar           Thai          4.6        True   \n",
       "\n",
       "                                 food_name food_types food_price  food_rating  \n",
       "0                    Beijing Chilli Prawns     NONVEG        260          5.0  \n",
       "1                     Hot Chilli Baby corn        VEG        150          5.0  \n",
       "2    Mixed Vegetable in Green Chilli Gravy        VEG        180          5.0  \n",
       "3                 Prawns Chinese Chop suey     NONVEG        220          5.0  \n",
       "4                    Spicy Vegetable Curry        VEG        170          5.0  \n",
       "..                                     ...        ...        ...          ...  \n",
       "111               Slice Grilled Beef Salad     NONVEG        540          5.0  \n",
       "112     Stir-Fried Squid With Curry Powder     NONVEG        595          5.0  \n",
       "113                          Tomkha Prawns     NONVEG        590          5.0  \n",
       "114                         Tomkha Seafood     NONVEG        495          5.0  \n",
       "115         Black Chilli Paste With Prawns     NONVEG        595          4.9  \n",
       "\n",
       "[116 rows x 9 columns]"
      ]
     },
     "execution_count": 201,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from src.RAG.Config.tool_models import GetCompetitorMenuModels\n",
    "\n",
    "f_params = GetCompetitorMenuModels.FunctionParams(\n",
    "    q_params=GetCompetitorMenuModels.QueryParams(\n",
    "        area='Indiranagar',\n",
    "        cuisine='Thai',\n",
    "        min_menu_rating=4.0,\n",
    "        limit=500,\n",
    "    ),\n",
    "    output='dataframe',\n",
    "    exclude={'rstn_city_id','rstn_ids', \"rstn_city\", \"rstn_locality\", \"rstn_address\", \"rstn_coords\"}\n",
    ")\n",
    "data = get_competitors_menu(**f_params.model_dump())\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 216,
   "id": "f366e328",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_menu_benchmark(\n",
    "    q_params: dict,\n",
    "    output: Literal['dict', 'dataframe'] = 'dict',\n",
    "    exclude: Set[str] = {\"ids\", \"city_id\"},\n",
    ")-> Dict[str, Any] | pd.DataFrame:\n",
    "    graph_query = \"\"\"\n",
    "    MATCH (:Area {name: $area})-[:HAS_LOCALITY]->(:Locality)-[:HAS_RESTAURANT]->(r:Restaurant)\n",
    "    MATCH (r)-[:SERVES_MAIN_CUISINE]->(:MainCuisine {name: $cuisine})\n",
    "    MATCH (r)-[link:HAS_MENU]->(m:Menu)\n",
    "    WHERE toLower(m.name) CONTAINS toLower($menu_name)\n",
    "        AND link.price IS NOT NULL\n",
    "    RETURN\n",
    "        m.name,\n",
    "        link.price,\n",
    "        link.rating,\n",
    "        r.name,\n",
    "        r.rating\n",
    "    ORDER BY link.price ASC\n",
    "    LIMIT $limit\n",
    "    \"\"\"\n",
    "    result = graph.query(graph_query, q_params).result_set\n",
    "    full_data = result\n",
    "    return pd.DataFrame(full_data) if output=='dataframe' else full_data\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "34828b20",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[['Spicy Vegetable Curry', 170, 5.0, 'China Garten', 4.3]]"
      ]
     },
     "execution_count": 220,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "f_params={\n",
    "    'q_params':{\n",
    "        \"area\": 'Indiranagar',\n",
    "        \"cuisine\": 'Thai',\n",
    "        \"menu_name\": 'Spicy Vegetable Curry',\n",
    "        \"limit\": 200,\n",
    "    },\n",
    "    \"output\": 'dict',\n",
    "    \"exclude\": {}\n",
    "}\n",
    "\n",
    "data = get_menu_benchmark(**f_params)\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 277,
   "id": "9f022a98",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_menu_oppourtunities(\n",
    "    q_params: dict,\n",
    "    output: Literal['dict', 'dataframe'] = 'dict',\n",
    "    exclude: Set[str] = {\"ids\", \"city_id\"},\n",
    ")-> Dict[str, Any] | pd.DataFrame:\n",
    "    graph_query= \"\"\"\n",
    "    MATCH (:Area {name:$area})-[:HAS_LOCALITY]->(:Locality)-[:HAS_RESTAURANT]->(r:Restaurant)\n",
    "    MATCH (r)-[:SERVES_MAIN_CUISINE]->(:MainCuisine {name:$cuisine})\n",
    "    MATCH (r)-[link:HAS_MENU]->(m:Menu)\n",
    "    WHERE link.rating IS NOT NULL AND link.rating >= $min_menu_rating\n",
    "    WITH\n",
    "        m.name AS menu_name,\n",
    "        m.types AS types,\n",
    "        count(DISTINCT r.ids) AS competitor_count,\n",
    "        avg(link.rating) AS avg_menu_rating,\n",
    "        min(link.price) AS min_menu_price,\n",
    "        avg(link.price) AS avg_menu_price,\n",
    "        max(link.price) AS max_menu_price,\n",
    "        stDev(link.price) AS sd_menu_price\n",
    "    RETURN\n",
    "        menu_name, types,\n",
    "        competitor_count,\n",
    "        avg_menu_rating,\n",
    "        min_menu_price,\n",
    "        avg_menu_price,\n",
    "        max_menu_price,\n",
    "        sd_menu_price\n",
    "    ORDER BY competitor_count ASC, avg_menu_rating DESC\n",
    "    LIMIT $limit\n",
    "    \"\"\"\n",
    "    result = graph.query(graph_query, q_params).result_set\n",
    "    columns = ['food_name', 'food_types', 'no_of_competitors', 'avg_menu_rating', \"min_menu_price\", \"avg_menu_price\", \"max_menu_price\", \"sd_menu_price\"]\n",
    "    full_data = {\n",
    "        key: [\n",
    "            item[columns.index(key)]\n",
    "            for item in result\n",
    "        ]\n",
    "        for key in columns\n",
    "    }\n",
    "    return pd.DataFrame(full_data) if output=='dataframe' else full_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 285,
   "id": "b153aa21",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>food_name</th>\n",
       "      <th>food_types</th>\n",
       "      <th>no_of_competitors</th>\n",
       "      <th>avg_menu_rating</th>\n",
       "      <th>min_menu_price</th>\n",
       "      <th>avg_menu_price</th>\n",
       "      <th>max_menu_price</th>\n",
       "      <th>sd_menu_price</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Paneer Pepper Salt (dry)</td>\n",
       "      <td>VEG</td>\n",
       "      <td>1</td>\n",
       "      <td>5.00</td>\n",
       "      <td>299.0</td>\n",
       "      <td>299.000000</td>\n",
       "      <td>299.0</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Chicken Hunan Steamed Rice</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>1</td>\n",
       "      <td>5.00</td>\n",
       "      <td>299.0</td>\n",
       "      <td>299.000000</td>\n",
       "      <td>299.0</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Fish In Pickle Chilli Sauce</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>1</td>\n",
       "      <td>5.00</td>\n",
       "      <td>499.0</td>\n",
       "      <td>499.000000</td>\n",
       "      <td>499.0</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Pork Mustard Momo (10 Pic)</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>1</td>\n",
       "      <td>5.00</td>\n",
       "      <td>280.0</td>\n",
       "      <td>280.000000</td>\n",
       "      <td>280.0</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Rad Naa Tao Hoo</td>\n",
       "      <td>VEG</td>\n",
       "      <td>1</td>\n",
       "      <td>5.00</td>\n",
       "      <td>370.0</td>\n",
       "      <td>370.000000</td>\n",
       "      <td>370.0</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>753</th>\n",
       "      <td>Chicken Thukpa</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>2</td>\n",
       "      <td>4.30</td>\n",
       "      <td>229.0</td>\n",
       "      <td>307.000000</td>\n",
       "      <td>385.0</td>\n",
       "      <td>110.308658</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>754</th>\n",
       "      <td>Veg Shanghai Fried Rice</td>\n",
       "      <td>VEG</td>\n",
       "      <td>2</td>\n",
       "      <td>4.30</td>\n",
       "      <td>225.0</td>\n",
       "      <td>237.000000</td>\n",
       "      <td>249.0</td>\n",
       "      <td>16.970563</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>755</th>\n",
       "      <td>Veg Hakka Noodles</td>\n",
       "      <td>VEG</td>\n",
       "      <td>2</td>\n",
       "      <td>4.30</td>\n",
       "      <td>219.0</td>\n",
       "      <td>224.500000</td>\n",
       "      <td>230.0</td>\n",
       "      <td>7.778175</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>756</th>\n",
       "      <td>Chicken Fried Rice</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>2</td>\n",
       "      <td>4.25</td>\n",
       "      <td>240.0</td>\n",
       "      <td>244.500000</td>\n",
       "      <td>249.0</td>\n",
       "      <td>6.363961</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>757</th>\n",
       "      <td>Veg Manchow Soup</td>\n",
       "      <td>VEG</td>\n",
       "      <td>3</td>\n",
       "      <td>4.50</td>\n",
       "      <td>165.0</td>\n",
       "      <td>196.666667</td>\n",
       "      <td>240.0</td>\n",
       "      <td>38.837267</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>758 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                       food_name food_types  no_of_competitors  \\\n",
       "0       Paneer Pepper Salt (dry)        VEG                  1   \n",
       "1     Chicken Hunan Steamed Rice     NONVEG                  1   \n",
       "2    Fish In Pickle Chilli Sauce     NONVEG                  1   \n",
       "3     Pork Mustard Momo (10 Pic)     NONVEG                  1   \n",
       "4                Rad Naa Tao Hoo        VEG                  1   \n",
       "..                           ...        ...                ...   \n",
       "753               Chicken Thukpa     NONVEG                  2   \n",
       "754      Veg Shanghai Fried Rice        VEG                  2   \n",
       "755            Veg Hakka Noodles        VEG                  2   \n",
       "756           Chicken Fried Rice     NONVEG                  2   \n",
       "757             Veg Manchow Soup        VEG                  3   \n",
       "\n",
       "     avg_menu_rating  min_menu_price  avg_menu_price  max_menu_price  \\\n",
       "0               5.00           299.0      299.000000           299.0   \n",
       "1               5.00           299.0      299.000000           299.0   \n",
       "2               5.00           499.0      499.000000           499.0   \n",
       "3               5.00           280.0      280.000000           280.0   \n",
       "4               5.00           370.0      370.000000           370.0   \n",
       "..               ...             ...             ...             ...   \n",
       "753             4.30           229.0      307.000000           385.0   \n",
       "754             4.30           225.0      237.000000           249.0   \n",
       "755             4.30           219.0      224.500000           230.0   \n",
       "756             4.25           240.0      244.500000           249.0   \n",
       "757             4.50           165.0      196.666667           240.0   \n",
       "\n",
       "     sd_menu_price  \n",
       "0         0.000000  \n",
       "1         0.000000  \n",
       "2         0.000000  \n",
       "3         0.000000  \n",
       "4         0.000000  \n",
       "..             ...  \n",
       "753     110.308658  \n",
       "754      16.970563  \n",
       "755       7.778175  \n",
       "756       6.363961  \n",
       "757      38.837267  \n",
       "\n",
       "[758 rows x 8 columns]"
      ]
     },
     "execution_count": 285,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "f_params={\n",
    "    'q_params':{\n",
    "        \"area\": 'Koramangala',\n",
    "        \"cuisine\": 'Thai',\n",
    "        \"min_menu_rating\": 4.0,\n",
    "        \"limit\": 1000,\n",
    "    },\n",
    "    \"output\": 'dataframe',\n",
    "    \"exclude\": {}\n",
    "}\n",
    "\n",
    "data = get_menu_oppourtunities(**f_params)\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 286,
   "id": "24f47071",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_overpriced_menu(\n",
    "    q_params: dict,\n",
    "    output: Literal['dict', 'dataframe'] = 'dict',\n",
    "    exclude: Set[str] = {\"ids\", \"city_id\"},\n",
    ")-> Dict[str, Any] | pd.DataFrame:\n",
    "    graph_query= \"\"\"\n",
    "    MATCH (:Area {name:$area})-[:HAS_LOCALITY]->(:Locality)-[:HAS_RESTAURANT]->(r:Restaurant)\n",
    "    MATCH (r)-[:SERVES_MAIN_CUISINE]->(:MainCuisine {name:$cuisine})\n",
    "    MATCH (r)-[link:HAS_MENU]->(m:Menu)\n",
    "    WHERE link.price IS NOT NULL AND link.rating IS NOT NULL\n",
    "    WITH\n",
    "        m.name AS menu_name,\n",
    "        avg(link.price) AS avg_price,\n",
    "        avg(link.rating) AS avg_rating,\n",
    "        count(*) AS listings\n",
    "    WHERE listings >= $min_listings\n",
    "    RETURN menu_name, avg_price, avg_rating, listings\n",
    "    ORDER BY avg_price DESC, avg_rating ASC\n",
    "    LIMIT $limit\n",
    "    \"\"\"\n",
    "    result = graph.query(graph_query, q_params).result_set\n",
    "    full_data = result\n",
    "    # columns = ['food_name', 'food_types', 'no_of_competitors', 'avg_menu_rating', \"min_menu_price\", \"avg_menu_price\", \"max_menu_price\", \"sd_menu_price\"]\n",
    "    # full_data = {\n",
    "    #     key: [\n",
    "    #         item[columns.index(key)]\n",
    "    #         for item in result\n",
    "    #     ]\n",
    "    #     for key in columns\n",
    "    # }\n",
    "    return pd.DataFrame(full_data) if output=='dataframe' else full_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 295,
   "id": "476f4a6c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[['Jasmine Rice with Basil Chicken And Fried Egg', 730.0, 5.0, 1],\n",
       " ['Deep Fried Fish Balls', 660.0, 4.0, 1],\n",
       " ['Stir Fried Seafood With Curry Powder', 660.0, 5.0, 1],\n",
       " ['Softshell Crab Chilli.', 635.0, 4.9, 1],\n",
       " ['Spicy Miso Ramen Pork.', 625.0, 4.4, 1],\n",
       " ['Pork Japanese Katsu Curry.', 625.0, 4.5, 1],\n",
       " ['Char Siu Pork Rice.', 625.0, 4.6, 1],\n",
       " ['Fritter Prawns', 605.0, 4.9, 1],\n",
       " ['Red Curry Seafood', 600.0, 3.0, 1],\n",
       " ['Tom Kha Seafood', 600.0, 4.0, 1],\n",
       " ['Pad Ke Maw Prawn (Spicy)', 600.0, 4.3, 1],\n",
       " ['Papaya Salad With Seafood', 600.0, 4.5, 1],\n",
       " ['Tom Yum Prawns', 600.0, 4.6, 1],\n",
       " ['Vermicelli Spicy Salad With Mint And Seafood', 600.0, 4.6, 1],\n",
       " ['Tom Yum Seafood', 600.0, 4.6, 1],\n",
       " ['Pad Thai Noodles With Seafood', 600.0, 4.6, 1],\n",
       " ['Seafood Spicy Salad With Mint', 600.0, 4.6, 1],\n",
       " ['Pad Thai Noodles With Prawns', 600.0, 4.7, 1],\n",
       " ['Tom Yum Noodles With Seafood', 600.0, 4.8, 1],\n",
       " ['Garlic Pepper Prawns', 600.0, 4.9, 1],\n",
       " ['Green Curry Prawns', 600.0, 5.0, 1],\n",
       " ['Red Curry Prawns', 600.0, 5.0, 1],\n",
       " ['Red Curry Squid', 600.0, 5.0, 1],\n",
       " ['Belgium Pork Spare Ribs.', 595.0, 4.9, 1],\n",
       " ['Deep Fried Prawn Balls', 595.0, 5.0, 1],\n",
       " ['Fried Rice Seafood', 585.0, 4.4, 1],\n",
       " ['Basil Fried Rice Prawns', 585.0, 4.8, 1],\n",
       " ['Fried Rice Prawns', 585.0, 4.8, 1],\n",
       " ['Basil Fried Rice Seafood', 585.0, 5.0, 1],\n",
       " ['Pork Manchurian Gravy', 580.0, 2.3, 1],\n",
       " ['Fried Rice Black Chilli Paste Prawns', 580.0, 3.0, 1],\n",
       " ['Spicy Curd Pork Dry', 580.0, 3.2, 1],\n",
       " ['Tom Yum Veg Soup', 580.0, 3.4, 1],\n",
       " ['Tom Yum Chicken Soup', 580.0, 4.6, 1],\n",
       " ['Roasted Chilli Pork Dry', 580.0, 4.6, 1],\n",
       " ['Roasted Chilli Pork Gravy', 580.0, 4.6, 1],\n",
       " ['Chilli Mustard Pork Dry', 580.0, 4.7, 1],\n",
       " ['Hot Pepper Pork Dry', 580.0, 4.7, 1],\n",
       " ['Cantonese Roasted Pork Dry', 580.0, 4.7, 1],\n",
       " ['Honey Spicy Pork Dry', 580.0, 4.8, 1],\n",
       " ['Singapore Roasted Pork Dry', 580.0, 4.9, 1],\n",
       " ['Pork Manchurian Dry', 580.0, 4.9, 1],\n",
       " ['Smoked Pork Dry', 580.0, 5.0, 1],\n",
       " ['Garlic Pepper Beef', 570.0, 4.0, 1],\n",
       " ['Nasi Goreng Non-Veg.', 545.0, 4.3, 1],\n",
       " ['Chicken Satay', 545.0, 4.4, 1],\n",
       " ['Pad Thai Noodles With Beef', 545.0, 4.4, 1],\n",
       " ['Hainanese Chicken Rice.', 545.0, 4.5, 1],\n",
       " ['Papaya Salad With Crispy Fish', 545.0, 4.5, 1],\n",
       " ['Rice Basil Beef And Fried Egg', 545.0, 4.7, 1],\n",
       " ['Tom Yum Noodles With Veg', 545.0, 4.7, 1],\n",
       " ['Rice Basil Chicken And Fried Egg', 545.0, 4.8, 1],\n",
       " ['Noodles With Braised Chicken', 545.0, 4.8, 1],\n",
       " ['Slice Grilled Beef Salad', 545.0, 5.0, 1],\n",
       " ['Cashew Nut Chicken', 545.0, 5.0, 1],\n",
       " ['Fried Rice Beef', 545.0, 5.0, 1],\n",
       " ['Beef Spicy Salad With Mint', 545.0, 5.0, 1],\n",
       " ['Clear Glass Noodles Soup Veg', 540.0, 3.1, 1],\n",
       " ['Veg Spring Roll(4 Pcs)', 540.0, 3.5, 1],\n",
       " ['Green Curry Veg', 540.0, 4.4, 1],\n",
       " ['Red Curry Veg', 540.0, 4.5, 1],\n",
       " ['Mixed Herb With Fried Chicken', 540.0, 4.7, 1],\n",
       " ['Red Curry Chicken', 540.0, 4.8, 1],\n",
       " ['Green Curry Chicken', 540.0, 4.8, 1],\n",
       " ['Fried Wonton With Chicken And Prawn', 540.0, 4.8, 1],\n",
       " ['Prawn Phad Phrik.', 535.0, 4.9, 1],\n",
       " ['Prawn Phad Thai.', 525.0, 3.6, 1],\n",
       " ['Nepali Thakali Set Fish', 525.0, 3.8, 1],\n",
       " ['Prawn Sen Yai Phad Kheemao.', 525.0, 3.8, 1],\n",
       " ['Nepali Thakali Set Mutton', 525.0, 4.4, 1],\n",
       " ['Chicken Japanese Katsu Curry.', 525.0, 4.6, 1],\n",
       " ['Prawns In Butter Garlic.', 525.0, 5.0, 1],\n",
       " ['Pad Ke Maw Veg (Spicy)', 520.0, 4.3, 1],\n",
       " ['Pad Ke Maw Chicken (Spicy)', 520.0, 4.3, 1],\n",
       " ['Fried Chicken Salted Wings', 520.0, 4.4, 1],\n",
       " ['Fried Rice Pineapple Veg', 520.0, 4.7, 1],\n",
       " ['Pad Thai Noodles With Veg', 515.0, 3.9, 1],\n",
       " ['Stir Fried Glass Noodles With Chicken', 515.0, 3.9, 1],\n",
       " ['Pad Thai Noodles With Chicken', 515.0, 4.6, 1],\n",
       " ['Papaya Salad With Papaya Salad With Fermented Fish Sauce', 510.0, 2.9, 1],\n",
       " ['Fried Wonton Veg', 510.0, 3.8, 1],\n",
       " ['Tom Kha Veg', 500.0, 4.0, 1],\n",
       " ['Lemon Spicy Chicken', 500.0, 4.4, 1],\n",
       " ['Tom Kha Chicken', 500.0, 4.9, 1],\n",
       " ['Fish In Pickle Chilli Sauce', 499.0, 5.0, 1],\n",
       " ['Fried Chicken Spicy Salad With Mint', 495.0, 3.0, 1],\n",
       " ['Noodles With Vegetables In Gravy', 495.0, 3.0, 1],\n",
       " ['Chicken Khaja Set', 495.0, 3.8, 1],\n",
       " ['Noodles With Chicken In Gravy', 495.0, 4.2, 1],\n",
       " ['Khauk-Shwe Prawn.', 495.0, 4.2, 1],\n",
       " ['Sliced Garlic Chicken.', 495.0, 4.3, 1],\n",
       " ['Gai Phad Phrik.', 495.0, 4.4, 1],\n",
       " ['Chicken Gaeng Kiew Wahn.', 495.0, 4.5, 1],\n",
       " ['Grilled Beef', 495.0, 4.7, 1],\n",
       " ['Tom Yum Talay', 495.0, 4.7, 1],\n",
       " ['Tofu Japanese Katsu Curry.', 495.0, 4.7, 1],\n",
       " ['Belgian Pork Bao.', 495.0, 4.7, 1],\n",
       " ['Deep Fried Mushroom Cake', 495.0, 4.9, 1],\n",
       " ['Tom Kha Talay', 495.0, 5.0, 1],\n",
       " ['Rad Naan - Talay', 494.0, 2.5, 1],\n",
       " ['Pad See Eww Talay', 494.0, 3.7, 1],\n",
       " ['Lab Talay', 494.0, 4.4, 1],\n",
       " ['Pad Thai Talay', 494.0, 4.8, 1],\n",
       " ['Yum Woon Sen Talay', 494.0, 5.0, 1],\n",
       " ['Guay Tiew Tom Yum Kung', 485.0, 4.5, 1],\n",
       " ['Mushroom Spicy Salad', 480.0, 3.8, 1],\n",
       " ['Mango Salad Veg For Vegetarian', 480.0, 4.0, 1],\n",
       " ['Basil Fried Rice Tofu', 480.0, 4.1, 1],\n",
       " ['Fried Rice Chicken', 480.0, 4.1, 1],\n",
       " ['Basil Fried Rice Chicken', 480.0, 4.2, 1],\n",
       " ['Fried Rice Tofu', 480.0, 4.3, 1],\n",
       " ['Stir Fried Tofu With Pepper And Salt', 480.0, 4.4, 1],\n",
       " ['Spicy Minced Chicken With Herbs', 480.0, 4.4, 1],\n",
       " ['Stir Fried Tofu Red Curry Paste', 480.0, 4.6, 1],\n",
       " ['Fried Rice Black Chilli Paste Chicken', 480.0, 4.6, 1],\n",
       " ['Garlic Pepper Chicken', 480.0, 4.6, 1],\n",
       " ['Thai Papaya Salad Veg For Vegetarian', 480.0, 4.8, 1],\n",
       " ['Stir Fried Chicken Oyster Sauce', 480.0, 4.8, 1],\n",
       " ['Thai Papaya Salad / Sauces Non Veg', 480.0, 4.9, 1],\n",
       " ['Stir Fried Vegetable Tofu', 480.0, 4.9, 1],\n",
       " ['Rice With Omelette', 480.0, 4.9, 1],\n",
       " ['Stir Fried Vegetables Chicken', 480.0, 4.9, 1],\n",
       " ['Stir Fried Chicken Red Curry Paste', 480.0, 5.0, 1],\n",
       " ['Garlic Pepper Tofu', 480.0, 5.0, 1],\n",
       " ['Mango Salad Non-Veg', 480.0, 5.0, 1],\n",
       " ['Pramukh Ka Thiem', 476.0, 2.6, 1],\n",
       " ['Kung Pad Prikh Pao', 476.0, 4.2, 1],\n",
       " ['Pramukh Tod', 476.0, 4.7, 1],\n",
       " ['Kung Tod.', 476.0, 4.9, 1],\n",
       " ['Pad Woon Sen Ka Pao Kung', 476.0, 5.0, 1],\n",
       " ['Khauk-Shwe Chicken.', 475.0, 3.5, 1],\n",
       " ['Slice Chicken In Butter Garlic.', 475.0, 4.1, 1],\n",
       " ['Chicken Phad Thai.', 475.0, 4.4, 1],\n",
       " ['Chicken Sen Yai Phad Kheemao.', 475.0, 4.6, 1],\n",
       " ['Momo Platter Chicken Large 16 Pcs', 475.0, 4.6, 1],\n",
       " ['Veg Khaja Set', 475.0, 4.9, 1],\n",
       " ['Slice Chicken In Chilli Soya Garlic.', 475.0, 5.0, 1],\n",
       " ['Pla Sam Rot', 474.0, 4.5, 1],\n",
       " ['Rad Naa Kung', 470.0, 3.0, 1],\n",
       " ['Tom Yum Kung', 470.0, 4.4, 1],\n",
       " ['Keang Kheiywhhwan - Talay', 470.0, 5.0, 1],\n",
       " ['Tom Kha Kung', 470.0, 5.0, 1],\n",
       " ['Kung Satay', 460.0, 3.6, 1],\n",
       " ['Rice Basil Tofu', 460.0, 4.3, 1],\n",
       " ['Rice Basil Mushroom', 460.0, 4.4, 1],\n",
       " ['Khaow Pad Ka Phao Talay - Khai Dao', 460.0, 4.4, 1],\n",
       " ['Beijing Chicken', 459.0, 3.9, 1],\n",
       " ['Rad Naa Pramukh', 456.0, 5.0, 1],\n",
       " ['Nepali Thakali Set Chicken', 455.0, 2.7, 1],\n",
       " ['Prawn Kampung Rice.', 455.0, 4.6, 1],\n",
       " ['Prawn Mie Goreng.', 455.0, 4.7, 1],\n",
       " ['Chicken Nasi Goreng', 450.0, 3.1, 1],\n",
       " ['Spicy Miso Ramen Chicken.', 450.0, 4.4, 1],\n",
       " ['Korean Ramen Chicken.', 450.0, 4.5, 1],\n",
       " ['Khauk-Shwe Veg.', 450.0, 4.8, 1],\n",
       " ['Keang Kheiywhhwan -Kung', 445.0, 4.4, 1],\n",
       " ['Keang Phet Kung', 445.0, 4.5, 1],\n",
       " ['Kung Ka Thiem', 445.0, 4.6, 1],\n",
       " ['Prawn Sui Mai With Tobiko.', 445.0, 4.9, 1],\n",
       " ['Pad Ka Phao--Kung', 445.0, 5.0, 1],\n",
       " ['Shredded Chicken In Chilli Oil.', 445.0, 5.0, 1],\n",
       " ['Kung Pad Num Man Hoi', 445.0, 5.0, 1],\n",
       " ['Khaow Pad Ka Phao Kung - Khai Dao', 440.0, 3.0, 1],\n",
       " ['Pad Thai Kung', 435.0, 4.4, 1],\n",
       " ['Pad See Ew Kung', 435.0, 4.8, 1],\n",
       " ['Prawn Fritter Bao.', 435.0, 4.8, 1],\n",
       " ['Pad Woon Sen Sai Kung', 435.0, 5.0, 1],\n",
       " ['Smoked buff thali', 430.0, 3.6, 1],\n",
       " ['Khaow Pad Kung', 430.0, 3.7, 1],\n",
       " ['Kai Satay', 430.0, 3.8, 1],\n",
       " ['Dynamite Shrimps', 429.0, 4.8, 1],\n",
       " ['Veg Phad Thai.', 425.0, 4.4, 1],\n",
       " ['Momo Platter Veg Large 16 Pcs', 425.0, 4.6, 1],\n",
       " ['Korean Ramen Veg.', 425.0, 4.6, 1],\n",
       " ['Water Chestnut', 425.0, 4.6, 1],\n",
       " ['Chicken Kampung Rice.', 425.0, 4.7, 1],\n",
       " ['Chicken Thai Tom Yum Fried Rice.', 425.0, 4.7, 1],\n",
       " ['Chicken Cantonesse Coopsue', 425.0, 4.8, 1],\n",
       " ['Japanese Curry Ramen Eggplant.', 425.0, 4.9, 1],\n",
       " ['Chicken Mie Goreng.', 425.0, 4.9, 1],\n",
       " ['Assorted Vegetables In Chilli Basil.', 425.0, 5.0, 1],\n",
       " ['Glutinous Rice Balls In Coconut Milk', 425.0, 5.0, 1],\n",
       " ['Chicken Pineapple Fried Rice.', 425.0, 5.0, 1],\n",
       " ['Khaow Pad Ka Phao Neua - Khai Dao', 420.0, 3.2, 1],\n",
       " ['Hunan Sauce Chicken', 415.0, 3.9, 1],\n",
       " ['Oyster Sauce Chicken', 415.0, 5.0, 1],\n",
       " ['Neua Pad Prikh Pao', 415.0, 5.0, 1],\n",
       " ['Tom Kha Kai', 410.0, 4.8, 1],\n",
       " ['Tom Yum Kai', 410.0, 4.9, 1],\n",
       " ['Guay Tiew Tom Yum Neua', 405.0, 2.9, 1],\n",
       " ['Nepali Thakali Set Egg', 405.0, 3.5, 1],\n",
       " ['Guay Tiew Num Sai Neua', 405.0, 4.5, 1],\n",
       " ['Korean Chicken Bao.', 405.0, 4.7, 1],\n",
       " ['Rad Naa Kai', 405.0, 4.9, 1],\n",
       " ['Guay Tiew Tom Yum Kai', 405.0, 5.0, 1],\n",
       " ['Khaichiao Kung Sub', 400.0, 4.8, 1],\n",
       " ['Lab Neua', 400.0, 5.0, 1],\n",
       " ['Prawns In Hot Garlic Sauce', 399.0, 3.7, 1],\n",
       " ['Jhol Momos Buff', 399.0, 4.2, 1],\n",
       " ['Dragon Prawns', 399.0, 4.4, 1],\n",
       " ['Lemon Basil Prawns', 399.0, 4.6, 1],\n",
       " ['Golden Fried Prawns', 399.0, 4.6, 1],\n",
       " ['Burnt Pepper Prawns', 399.0, 4.8, 1],\n",
       " ['Thai Prawns Red Curry', 399.0, 4.8, 1],\n",
       " ['Kothey Momos Buff', 399.0, 4.9, 1],\n",
       " ['Sweet & Sour Prawns', 399.0, 5.0, 1],\n",
       " ['Prawns In Hot Bean Sauce', 399.0, 5.0, 1],\n",
       " ['Pad Ka Pao Nuea', 395.0, 2.6, 1],\n",
       " ['Buff Chilly', 395.0, 2.8, 1],\n",
       " ['Buff Sukuti Sandheko', 395.0, 3.5, 1],\n",
       " ['Tom Jud Kai', 395.0, 4.3, 1],\n",
       " ['Japanese Cheese Cake.', 395.0, 4.4, 1],\n",
       " ['Steamed Chicken & Prawn Wonton.', 395.0, 4.4, 1],\n",
       " ['Cheese Wontons.', 395.0, 4.6, 1],\n",
       " ['Millionaires Brownies.', 395.0, 4.8, 1],\n",
       " ['Yakitori Chicken & Leeks.', 395.0, 4.8, 1],\n",
       " ['Oriental chicken satay.', 395.0, 4.9, 1],\n",
       " ['Pad Woon Sen Ka Pao Neua', 395.0, 5.0, 1],\n",
       " ['Broccoli Bokchoy and Mushroom with Black pepper.', 395.0, 5.0, 1],\n",
       " ['Kai Pad Prikh Pao', 390.0, 2.5, 1],\n",
       " ['Pork Chilli Garlic Curry Fried Rice', 390.0, 3.0, 1],\n",
       " ['Kai Phad Phng Kari', 390.0, 3.1, 1],\n",
       " ['Pork Thai Red Curry Fried Rice', 390.0, 3.7, 1],\n",
       " ['Pad Woon Sen Sai Kai', 390.0, 4.0, 1],\n",
       " ['Pad Prikh Keang -Kai', 390.0, 4.3, 1],\n",
       " ['Keang Kheiywhhwan Tao Hoo', 390.0, 4.3, 1],\n",
       " ['Pad Woon Sen Ka Pao Kai', 390.0, 4.3, 1],\n",
       " ['Pad See Ew Kai', 390.0, 4.4, 1],\n",
       " ['Keang Phet Tao Hoo', 390.0, 4.4, 1],\n",
       " ['Pad Thai Kai', 390.0, 4.5, 1],\n",
       " ['Pork Steamed Curry Fried Rice', 390.0, 4.6, 1],\n",
       " ['Keang Kheiywhhwan -Kai', 390.0, 4.6, 1],\n",
       " ['Pad Ka Phao--Kai', 390.0, 4.7, 1],\n",
       " ['Kai Pad Khing', 390.0, 4.7, 1],\n",
       " ['Keang Phet Kai', 390.0, 4.7, 1],\n",
       " ['Kai Pad Num Man Hoi', 390.0, 4.7, 1],\n",
       " ['Pad Prieow Wan Tao Hoo', 390.0, 4.8, 1],\n",
       " ['Khaow Pad Ka Phao Kai - Khai Dao', 390.0, 4.8, 1],\n",
       " ['Pad Ka Pao Tao Hoo', 390.0, 4.9, 1],\n",
       " ['Kai Ka Thiem', 390.0, 4.9, 1],\n",
       " ['Yum Woonsen-Kai', 390.0, 5.0, 1],\n",
       " ['Momo Platter Chicken 12 Pcs', 385.0, 4.2, 1],\n",
       " ['Tofu & Water Chestnut Chilly Basil.', 385.0, 4.3, 1],\n",
       " ['Crispy Lotus Thai Chilly Basil.', 385.0, 4.4, 1],\n",
       " ['Vietnamese Summer Roll.', 385.0, 4.5, 1],\n",
       " ['Nepali Thakali Set Veg', 385.0, 4.5, 1],\n",
       " ['Sriracha Tofu Bao.', 385.0, 4.6, 1],\n",
       " ['Thai Chilli Mushroom Bao.', 385.0, 4.6, 1],\n",
       " ['Thai Chicken Green Curry', 385.0, 4.6, 1],\n",
       " ['Spicy Edamame Balado.', 385.0, 4.7, 1],\n",
       " ['Thai Chicken Red Curry', 385.0, 4.9, 1],\n",
       " ['Pad See Ew Tao Hoo', 380.0, 3.3, 1],\n",
       " ['Khai Yad Sai', 380.0, 4.3, 1],\n",
       " ['Pad Woon Sen Ka Pao Tao Hoo', 380.0, 4.6, 1],\n",
       " ['Khaow Pad Kai', 380.0, 4.9, 1],\n",
       " ['Burnt Pepper Fish', 379.0, 3.7, 1],\n",
       " ['Dragon Fish', 379.0, 4.0, 1],\n",
       " ['Lemon Basil Fish', 379.0, 4.4, 1],\n",
       " ['Fish Finger', 379.0, 4.6, 1],\n",
       " ['Fish In Chilli Garlic Sauce', 379.0, 4.8, 1],\n",
       " ['Hunan Fish', 379.0, 5.0, 1],\n",
       " ['Fish In Oyster Sauce', 379.0, 5.0, 1],\n",
       " ['Prawns In Sambal Sauce', 379.0, 5.0, 1],\n",
       " ['Lab Kai', 378.0, 5.0, 1],\n",
       " ['Fried Momos Buff', 375.0, 2.9, 1],\n",
       " ['Veg Pineapple Fried Rice.', 375.0, 4.4, 1],\n",
       " ['Chicken Potsticker.', 375.0, 4.6, 1],\n",
       " ['Steamed Edamame With Truffle.', 375.0, 4.6, 1],\n",
       " ['Veg Kampung Rice.', 375.0, 4.7, 1],\n",
       " ['Veg Mie Goreng.', 375.0, 4.7, 1],\n",
       " ['Veg Thai Tom Yum Fried Rice.', 375.0, 4.9, 1],\n",
       " ['Chilli Prawns Gravy', 370.0, 2.5, 1],\n",
       " ['Fish in Ginger Sauce', 370.0, 3.0, 1],\n",
       " ['Pad Thai Tao Hoo', 370.0, 3.9, 1],\n",
       " ['Prawns Schezwan Style Dry', 370.0, 4.0, 1],\n",
       " ['Thai Fried Fish', 370.0, 4.0, 1],\n",
       " ['Crispy Leefu Prawns Dry', 370.0, 4.0, 1],\n",
       " ['Fish Thai Red Curry', 370.0, 4.0, 1],\n",
       " ['Prawns in Thai Sauce', 370.0, 4.0, 1],\n",
       " ['Fish in Hot Garlic Gravy', 370.0, 4.0, 1],\n",
       " ['Fish Finger Dry', 370.0, 4.0, 1],\n",
       " ['Crispy Spinach Prawns Dry', 370.0, 4.0, 1],\n",
       " ['Chilli Prawns Dry', 370.0, 4.1, 1],\n",
       " ['Hot Pepper Prawns Dry', 370.0, 4.2, 1],\n",
       " ['Pepper Salt Fish Dry', 370.0, 4.4, 1],\n",
       " ['Fish Manchurian Dry', 370.0, 4.6, 1],\n",
       " ['Singapore Fish Dry', 370.0, 4.7, 1],\n",
       " ['Fish Chilli Dry', 370.0, 4.8, 1],\n",
       " ['Som Tum Pla - Ra', 370.0, 4.8, 1],\n",
       " ['Lemongrass Chilli Prawns Dry', 370.0, 4.9, 1],\n",
       " ['Rad Naa Tao Hoo', 370.0, 5.0, 1],\n",
       " ['Prawns Manchurian Dry', 370.0, 5.0, 1],\n",
       " ['Lemongrass Chilli Fish Dry', 370.0, 5.0, 1],\n",
       " ['Dragan Fish Dry', 370.0, 5.0, 1],\n",
       " ['Fish Manchurian Gravy', 370.0, 5.0, 1],\n",
       " ['Prawns in Hot Garlic Sauce', 370.0, 5.0, 1],\n",
       " ['Prawns in Hunan Sauce', 370.0, 5.0, 1],\n",
       " ['Prawns Manchurian Gravy', 370.0, 5.0, 1],\n",
       " ['Fish with Broccoli White Sauce', 370.0, 5.0, 1],\n",
       " ['Dragon Prawns Dry', 370.0, 5.0, 1],\n",
       " ['Chilli Crispy Fish Dry', 370.0, 5.0, 1],\n",
       " ['Thai Fried Prawns', 370.0, 5.0, 1],\n",
       " ['Fish in Hot Garlic Dry', 370.0, 5.0, 1],\n",
       " ['Fish Chilli Gravy', 370.0, 5.0, 1],\n",
       " ['Sandeko Momos Chicken', 365.0, 1.5, 1],\n",
       " ['Egg Thukpa', 365.0, 3.9, 1],\n",
       " ['Gravy Momos Chicken', 365.0, 4.2, 1],\n",
       " ['Chicken Wai Wai Pakayeko', 365.0, 4.7, 1],\n",
       " ['Tom Jud Tao Hoo Sai Woon Sen', 365.0, 4.8, 1],\n",
       " ['Tom Jud Hed - Woon Sen', 360.0, 2.0, 1],\n",
       " ['Thai Veg Red Curry With Steamed Rice', 360.0, 3.1, 1],\n",
       " ['Mixed Pad Thai', 360.0, 4.0, 1],\n",
       " ['Thai Veg Green Curry With Steamed Rice', 360.0, 4.8, 1],\n",
       " ['Tom Yum Tao Hoo', 360.0, 5.0, 1],\n",
       " ['Mixed Phad Ki Mao', 359.0, 4.2, 1],\n",
       " ['Mix Phad Ki Mao [Non-veg]', 359.0, 5.0, 1],\n",
       " ['Momo Platter Veg 12 Pcs', 355.0, 4.0, 1],\n",
       " ['Sen Mee Pad Ka Pao Tao Hoo', 350.0, 3.3, 1],\n",
       " ['Darjelling Momos Chicken', 350.0, 3.4, 1],\n",
       " ['Tao Hoo Ka Thiem', 350.0, 3.6, 1],\n",
       " ['Golbhedha & Timur Momos Chicken', 350.0, 3.7, 1],\n",
       " ['Pad Prikh Keang Tao Hoo', 350.0, 4.0, 1],\n",
       " ['Prawns Pad Thai', 350.0, 4.0, 1],\n",
       " ['Smoked pork with anishi', 350.0, 4.3, 1],\n",
       " ['Smoked buff with kholar', 350.0, 4.3, 1],\n",
       " ['Tandoori Momos Chicken', 350.0, 4.4, 1],\n",
       " ['Pad Pukh Tao Hoo', 350.0, 4.5, 1],\n",
       " ['Bhoot Momos Chicken', 350.0, 4.7, 1],\n",
       " ['Momo Platter Buff 8 Pcs', 350.0, 4.8, 1],\n",
       " ['Afghani Tandoori Momos Chicken', 350.0, 4.8, 1],\n",
       " ['Tao Hoo Pad Men Mamuang Himmapan', 350.0, 5.0, 1],\n",
       " ['Tsinghai Chicken', 349.0, 2.4, 1],\n",
       " ['Honey Hunan Chicken', 349.0, 3.2, 1],\n",
       " ['Dim Sum Chilli Chicken', 349.0, 3.3, 1],\n",
       " ['Chicken In Pickle Chilli Sauce', 349.0, 3.3, 1],\n",
       " ['Sweet & Sour Chicken', 349.0, 3.4, 1],\n",
       " ['Chicken In Hot Bean Sauce', 349.0, 3.6, 1],\n",
       " ['Chicken In Hoisin Sauce', 349.0, 3.7, 1],\n",
       " ['Taipei Chicken', 349.0, 3.9, 1],\n",
       " ['Roast Chicken In Chilli Plum Sauce', 349.0, 3.9, 1],\n",
       " ['Korean Bbq Chicken Wings (6 Pc)', 349.0, 4.0, 1],\n",
       " ['Hong Kong Chicken', 349.0, 4.0, 1],\n",
       " ['Burnt Pepper Chicken', 349.0, 4.0, 1],\n",
       " [\"General Tso's Chicken\", 349.0, 4.1, 1],\n",
       " ['Crispy Peking Chicken', 349.0, 4.1, 1],\n",
       " ['Chicken In Black Pepper Sauce', 349.0, 4.2, 1],\n",
       " ['Honey Chilli Chicken', 349.0, 4.2, 1],\n",
       " ['Chicken Lollipop', 349.0, 4.3, 1],\n",
       " ['Drums Of Heaven (chicken)', 349.0, 4.3, 1],\n",
       " ['Crispy Chicken Honey Pepper', 349.0, 4.3, 1],\n",
       " ['Great Wall Chicken', 349.0, 4.4, 1],\n",
       " ['Thai Chilli Chicken', 349.0, 4.4, 1],\n",
       " ['Lemon Basil Chicken', 349.0, 4.5, 1],\n",
       " ['Pan Fried Chicken With Celery & Onion', 349.0, 4.6, 1],\n",
       " ['Chicken With Lemon Sauce', 349.0, 4.7, 1],\n",
       " ['Kung Pao Chicken', 349.0, 4.7, 1],\n",
       " ['Ginger Chicken', 349.0, 4.7, 1],\n",
       " ['Crispy Spinach Chicken', 349.0, 4.7, 1],\n",
       " ['Chicken Pepper Salt', 349.0, 4.9, 1],\n",
       " ['Roast Chicken With Vegetables', 349.0, 4.9, 1],\n",
       " ['Chilli Basil Chicken', 349.0, 4.9, 1],\n",
       " ['Kai Phad Namprik (chicken)', 349.0, 5.0, 1],\n",
       " ['Tsing Hoi Chicken', 349.0, 5.0, 1],\n",
       " ['Vegetables In Manchurian Sauce', 345.0, 3.3, 1],\n",
       " ['Chilly Paneer', 345.0, 3.4, 1],\n",
       " ['Crunchy Salmon Maki.', 345.0, 4.0, 1],\n",
       " ['Sake (Salmon).', 345.0, 4.4, 1],\n",
       " ['Classic California Roll.', 345.0, 4.6, 1],\n",
       " ['Itame Maki', 345.0, 4.8, 1],\n",
       " ['Momo Platter Chicken 8 Pcs', 345.0, 4.9, 1],\n",
       " ['Dragon Chicken', 343.0, 4.1, 3],\n",
       " ['Tom Kha Hed', 340.0, 3.2, 1],\n",
       " ['Keang Kheiywhhwan Pukh', 340.0, 3.7, 1],\n",
       " ['Tom Yum Hed', 340.0, 4.0, 1],\n",
       " ['Pad See Ew Pukh', 340.0, 4.2, 1],\n",
       " ['Steam Momos Buff', 340.0, 4.2, 1],\n",
       " ['Pad Thai Pukh', 340.0, 4.5, 1],\n",
       " ['Pad Woon Sen Sai Pukh', 340.0, 4.6, 1],\n",
       " ['Som Tum Thai', 340.0, 4.6, 1],\n",
       " ['Tom Kha Tao Hoo', 340.0, 4.6, 1],\n",
       " ['Pad Woon Sen Ka Pao Pukh', 340.0, 4.8, 1],\n",
       " ['Keang Phet Hed', 340.0, 4.9, 1],\n",
       " ['Thai Fried Chicken', 339.5, 3.9, 2],\n",
       " ['Bhoot Wings', 335.0, 3.6, 1],\n",
       " ['Miso Veg Gyoza.', 335.0, 4.8, 1],\n",
       " ['Veg Wai Wai Pakayeko', 335.0, 4.8, 1],\n",
       " ['Spicy Curd Chicken Lollipop ( 6 pic)', 331.0, 5.0, 1],\n",
       " ['Spicy Curd Chicken', 330.0, 3.0, 1],\n",
       " ['Crispy Leefu Chicken', 330.0, 3.0, 1],\n",
       " ['Singapore Chicken', 330.0, 3.0, 1],\n",
       " ['Chicken Hunan Sauce', 330.0, 3.0, 1],\n",
       " ['Chilli Chicken Dry', 330.0, 3.3, 1],\n",
       " ['Chicken Hot Garlic Sauce', 330.0, 3.4, 1],\n",
       " ['Chilli Chicken Gravy', 330.0, 3.6, 1],\n",
       " ['Crispy Spanish Chicken', 330.0, 3.6, 1],\n",
       " ['Chicken with Coriander Sauce', 330.0, 3.6, 1],\n",
       " ['Honey Spicy Chicken Lollipop (6 pic)', 330.0, 3.7, 1],\n",
       " ['Shredded Chicken Green & Red Pepper Dry', 330.0, 3.8, 1],\n",
       " ['Chicken Pad Thai', 330.0, 4.0, 1],\n",
       " ['Crispy Lemongrass Chicken', 330.0, 4.1, 1],\n",
       " ['Shredded Chicken with Garlic Sauce', 330.0, 4.1, 1],\n",
       " ['Shredded Chicken Green & Red Pepper Gravy', 330.0, 4.1, 1],\n",
       " ['Crispy Chicken Lollipop(6 pic)', 330.0, 4.2, 1],\n",
       " ['Chicken Phad Ki Mao', 330.0, 4.2, 1],\n",
       " ['Crispy Schezwan Chicken', 330.0, 4.2, 1],\n",
       " ['Chicken Lollipop ( 6 pic)', 330.0, 4.3, 1],\n",
       " ['Chilli Chicken with Basil Sauce', 330.0, 4.3, 1],\n",
       " ['Smoked Chicken Dry', 330.0, 4.4, 1],\n",
       " ['Tao Hoo Pad Med Mamung Himaphan', 330.0, 4.5, 1],\n",
       " ['Chicken Manchurian Dry', 330.0, 4.6, 1],\n",
       " ['Chicken Manchurian Gravy', 330.0, 4.6, 1],\n",
       " ['Chicken with Mushroom White Sauce', 330.0, 4.7, 1],\n",
       " ['Hed Pad Num Mun Hoi', 330.0, 4.7, 1],\n",
       " ['Crispy Honey Spicy Chicken', 330.0, 4.8, 1],\n",
       " ['Pad Ka Pao Hed', 330.0, 4.8, 1],\n",
       " ['Chicken in Garlic Sauce', 330.0, 4.9, 1],\n",
       " ['Chicken Chilli Garlic Sauce', 330.0, 4.9, 1],\n",
       " ['Sliced Chicken with Oyster Sauce', 330.0, 5.0, 1],\n",
       " ['Crispy Chicken Finger', 330.0, 5.0, 1],\n",
       " ['Chicken Schezwan Sauce', 330.0, 5.0, 1],\n",
       " ['Chilli Chicken Dim Sum', 330.0, 5.0, 1],\n",
       " ['Hot Pepper Chicken', 330.0, 5.0, 1],\n",
       " ['Mixed Triple Schezwan Steamed Rice', 329.0, 4.0, 1],\n",
       " ['Dragon Prawns With Vegetable Chow Mein Bowl', 329.0, 4.0, 1],\n",
       " ['Chicken Steamed Momos', 329.0, 4.4, 1],\n",
       " ['Shredded Threaded Chicken', 329.0, 4.5, 1],\n",
       " ['Mixed Hunan Steamed Rice - Koithio', 329.0, 4.5, 1],\n",
       " ['Dragon Rolls With Garlic Sauce (chicken)', 329.0, 4.6, 1],\n",
       " ['Chicken Fried Momos', 329.0, 5.0, 1],\n",
       " ['Chicken Dragon Chopsuey', 327.0, 3.65, 2],\n",
       " ['Sandeko Momos Veg', 325.0, 3.3, 1],\n",
       " ['Chilly Chicken Boneless', 325.0, 4.0, 1],\n",
       " ['Darjelling Momos Veg', 325.0, 4.1, 1],\n",
       " ['Steam Momos Chicken', 325.0, 4.1, 1],\n",
       " ['Kothey Momos Chicken', 325.0, 4.2, 1],\n",
       " ['Spicy Chicken Katsu.', 325.0, 4.3, 1],\n",
       " ['Gravy Momos Veg', 325.0, 4.4, 1],\n",
       " ['Jhol Momos Chicken', 325.0, 4.5, 1],\n",
       " ['Ebi Tempura.', 325.0, 4.5, 1],\n",
       " ['Tandoori Momos Veg', 325.0, 4.7, 1],\n",
       " ['Afghani Tandoori Momos Veg', 325.0, 4.8, 1],\n",
       " ['Fried Momos Chicken', 325.0, 4.8, 1],\n",
       " ['Pandan Pudding In Coconut Cream', 325.0, 4.8, 1],\n",
       " ['Bhoot Momos Veg', 325.0, 4.9, 1],\n",
       " ['Crunchy Tuna Maki.', 325.0, 5.0, 1],\n",
       " ['Chicken American Chopsuey', 322.0, 3.8, 2],\n",
       " ['Smoked buff with potato', 320.0, 4.7, 1],\n",
       " ['Pearl Thai Milk Tea', 320.0, 4.9, 1],\n",
       " ['Mixed Khao Phad Kapro', 319.0, 2.2, 1],\n",
       " ['Prawn Hunan Steamed Rice - Koithio', 319.0, 4.0, 1],\n",
       " ['Prawn Triple Schezwan Steamed Rice', 319.0, 4.3, 1],\n",
       " ['Mixed Steamed Rice - Koithio', 319.0, 5.0, 1],\n",
       " ['Momo Platter Veg 8 Pcs', 315.0, 3.7, 1],\n",
       " ['Chicken Sandheko', 315.0, 4.0, 1],\n",
       " ['Prawns Khao Phad Kapro', 315.0, 4.1, 1],\n",
       " ['Chilly Chicken', 315.0, 4.3, 1],\n",
       " ['Jhol Momos Veg', 315.0, 4.5, 1],\n",
       " ['Paneer Chilly', 315.0, 5.0, 1],\n",
       " ['Seafood Thai Curry with Noodles', 310.0, 2.4, 1],\n",
       " ['Seafood Chow mein with Curry', 310.0, 2.9, 1],\n",
       " ['Chinese Seafood Crispy Chop suey', 310.0, 3.0, 1],\n",
       " ['Seafood Chilli Garlic Curry with Noodles', 310.0, 3.0, 1],\n",
       " ['Seafood Leefu Curry with Noodles', 310.0, 4.0, 1],\n",
       " ['Dragon Crispy Seafood Chop suey', 310.0, 4.0, 1],\n",
       " ['American Seafood Crispy Chop suey', 310.0, 4.0, 1],\n",
       " ['Dragon Soft Seafood Chop suey', 310.0, 4.0, 1],\n",
       " ['Tum Khao Phod', 310.0, 4.1, 1],\n",
       " ['Seafood Canton Curry with Rice', 310.0, 4.1, 1],\n",
       " ['Seafood Chilli Garlic Curry with Rice', 310.0, 5.0, 1],\n",
       " ['Seafood Hunan Curry with Rice', 310.0, 5.0, 1],\n",
       " ['Pad See Ew Khai', 310.0, 5.0, 1],\n",
       " ['Seafood Steamed Curry with Rice', 310.0, 5.0, 1],\n",
       " ['Seafood Thai Curry with Rice', 310.0, 5.0, 1],\n",
       " ['Seafood Hunan Curry with Noodles', 310.0, 5.0, 1],\n",
       " ['Chicken Thukpa', 307.0, 4.3, 2],\n",
       " ['Tom Yum Prawn.', 305.0, 5.0, 1],\n",
       " ['Buddha Delight', 300.0, 3.2, 1],\n",
       " ['Ice Thai Milk Green Tea', 300.0, 4.3, 1],\n",
       " ['Pork Spring Roll (2 Pieces)', 300.0, 4.8, 1],\n",
       " ['Mixed Schezwan Steamed Rice', 299.0, 2.0, 1],\n",
       " ['Mixed Stewed Rice', 299.0, 2.3, 1],\n",
       " ['Mapo Tofu', 299.0, 2.9, 1],\n",
       " ['Prawns Stewed Rice', 299.0, 3.3, 1],\n",
       " ['Lemon Basil Paneer (dry)', 299.0, 3.7, 1],\n",
       " ['Fried Tofu & Broccoli In Chilli Plum Sauce', 299.0, 3.7, 1],\n",
       " ['Crispy Peking Baby Corn', 299.0, 3.9, 1],\n",
       " ['Szechuan Paneer (gravy)', 299.0, 3.9, 1],\n",
       " ['Honey Chilli Lotus Stem', 299.0, 3.9, 1],\n",
       " ['Prawns Schezwan Steamed Rice', 299.0, 4.0, 1],\n",
       " ['Veg Pad Thai', 299.0, 4.0, 1],\n",
       " ['Mixed Vegetables In Szechuan Sauce', 299.0, 4.0, 1],\n",
       " ['Chilli Paneer (gravy)', 299.0, 4.0, 1],\n",
       " ['Mixed Hunan Steamed Rice', 299.0, 4.0, 1],\n",
       " ['Szechuan Paneer (dry)', 299.0, 4.0, 1],\n",
       " ['Lotus Stem Salt And Pepper', 299.0, 4.0, 1],\n",
       " ['Paneer Manchurian (dry)', 299.0, 4.1, 1],\n",
       " ['Mixed Veg In Pickle Chilli Sauce', 299.0, 4.1, 1],\n",
       " ['Crispy Chilli Baby Corn', 299.0, 4.1, 1],\n",
       " ['Ninhao Special Momo Combo (non Veg)', 299.0, 4.1, 1],\n",
       " ['Chilli Paneer Dry', 299.0, 4.2, 1],\n",
       " ['Crispy Dragon Vegetable', 299.0, 4.3, 1],\n",
       " ['Pepper Corn Kernels', 299.0, 4.3, 1],\n",
       " ['Mixed Vegetables In Pepper Salt', 299.0, 4.3, 1],\n",
       " ['Kung Pao Tofu', 299.0, 4.3, 1],\n",
       " [\"Buddha's Delight\", 299.0, 4.3, 1],\n",
       " ['Honey Spiced Potato', 299.0, 4.4, 1],\n",
       " ['Baby Corn Mushroom Pepper Celery', 299.0, 4.5, 1],\n",
       " ['Mushroom Pepper Salt', 299.0, 4.5, 1],\n",
       " ['Chicken Spring Rolls', 299.0, 4.6, 1],\n",
       " ['Mixed Veg Hong Kong Baby Corn Mushroom', 299.0, 4.6, 1],\n",
       " ['Veg Balls In Hot Garlic Sauce', 299.0, 4.6, 1],\n",
       " ['Chicken Fried Wontons', 299.0, 4.6, 1],\n",
       " ['Kung Pao Chicken With Hakka Noodles Bowl', 299.0, 4.7, 1],\n",
       " ['Golden Fried Baby Corn', 299.0, 4.7, 1],\n",
       " ['Chicken Khao Phad Kapro', 299.0, 4.7, 1],\n",
       " ['Veg Fried Momos', 299.0, 4.7, 1],\n",
       " ['Chicken Schezwan Steamed Rice', 299.0, 4.7, 1],\n",
       " ['Crispy Chilli Vegetable', 299.0, 4.7, 1],\n",
       " ['Garlic Chicken With Egg Fried Rice Bowl', 299.0, 4.7, 1],\n",
       " ['Stir Fried Chinese Greens', 299.0, 4.7, 1],\n",
       " ['Baby Corn & Bamboo Shoot In Chilli Bean Sauce', 299.0, 4.7, 1],\n",
       " ['Chilli Garlic Potato', 299.0, 4.8, 1],\n",
       " ['Crispy Schezwan Vegetable', 299.0, 4.9, 1],\n",
       " ['Mixed Steamed Rice', 299.0, 4.9, 1],\n",
       " ['Mixed Vegetables In Chilli Sauce', 299.0, 5.0, 1],\n",
       " ['Stir Fried Broccoli', 299.0, 5.0, 1],\n",
       " ['Paneer Pepper Salt (dry)', 299.0, 5.0, 1],\n",
       " ['Prawns Steamed Rice - Koithio', 299.0, 5.0, 1],\n",
       " ['Mixed Veg In Devils Sauce', 299.0, 5.0, 1],\n",
       " ['Mixed Vegetables In Hunan Sauce', 299.0, 5.0, 1],\n",
       " ['Chicken Hunan Steamed Rice', 299.0, 5.0, 1],\n",
       " ['Crispy Spinach Baby Corn', 299.0, 5.0, 1],\n",
       " ['Hunan Tofu', 299.0, 5.0, 1],\n",
       " ['Potato Black Pepper Sauce', 299.0, 5.0, 1],\n",
       " ['Por Pia Sai Pak', 298.0, 4.0, 1],\n",
       " ['Burnt Pepper Paneer(dry)', 298.0, 5.0, 1],\n",
       " ['Laping Chicken', 295.0, 4.0, 1],\n",
       " ['Fried Momos Veg', 295.0, 4.0, 1],\n",
       " ['Keema Noodels Buff', 295.0, 4.3, 1],\n",
       " ['Pad Pukh', 295.0, 4.4, 1],\n",
       " ['Spring Rolls Tod', 295.0, 4.4, 1],\n",
       " ['Yasai Tempura Maki.', 295.0, 4.5, 1],\n",
       " ['Veg Paradise Maki.', 295.0, 4.6, 1],\n",
       " ['Kothey Momos Veg', 295.0, 4.6, 1],\n",
       " ['Kapa Hosomaki.', 295.0, 4.8, 1],\n",
       " ['Nasi Lemak Rice.', 295.0, 4.8, 1],\n",
       " ['Crunchy Asparagus Tempura Maki.', 295.0, 4.9, 1],\n",
       " ['Chilly Potato', 295.0, 5.0, 1],\n",
       " ['Paneer Chilli Gravy', 290.0, 1.5, 1],\n",
       " ['Pork Chilli Garlic Noodles', 290.0, 3.3, 1],\n",
       " ['Khai- Chiao', 290.0, 3.3, 1],\n",
       " ['Khao Phod Tod', 290.0, 3.6, 1],\n",
       " ['Paneer Chilli Dry', 290.0, 3.8, 1],\n",
       " ['Schezwan Paneer Gravy', 290.0, 4.0, 1],\n",
       " ['Schezwan Paneer Dry', 290.0, 4.0, 1],\n",
       " ['Pork Roasted Broccoli Fried Rice', 290.0, 4.2, 1],\n",
       " ['Pork Fried Noodles', 290.0, 4.2, 1],\n",
       " ['Pork Schezwan Noodles', 290.0, 4.2, 1],\n",
       " ['Pork Chilli Garlic Fried Rice', 290.0, 4.3, 1],\n",
       " ['Jasmine Rice', 290.0, 4.6, 1],\n",
       " ['Pork Fried  Rice', 290.0, 4.8, 1],\n",
       " ['Pork Roasted Broccoli Noodles', 290.0, 4.8, 1],\n",
       " ['Paneer Manchurian Dry', 290.0, 4.9, 1],\n",
       " ['Paneer Manchurian Gravy', 290.0, 5.0, 1],\n",
       " ['Pork Singapore Noodles', 290.0, 5.0, 1],\n",
       " ['Pork Schezwan Fried Rice', 290.0, 5.0, 1],\n",
       " ['Fried pork', 289.0, 2.3, 1],\n",
       " ['Mixed Dragon Chopsuey', 289.0, 3.6, 1],\n",
       " ['Mixed American Chopsuey', 289.0, 4.1, 1],\n",
       " ['Chicken Steamed Rice', 289.0, 4.2, 1],\n",
       " ['Mixed Chinese Chopsuey', 289.0, 4.4, 1],\n",
       " ['Chicken Stewed Rice', 289.0, 4.6, 1],\n",
       " ['Prawns Schezwan Fried Rice', 285.0, 3.9, 1],\n",
       " ['Steam Momos Veg', 285.0, 4.1, 1],\n",
       " ['Chicken Spring Roll', 285.0, 4.2, 1],\n",
       " ['Tom Yum Chicken.', 285.0, 4.4, 1],\n",
       " ['Ice Thai Milk Tea', 285.0, 4.5, 1],\n",
       " ['Vietnamese Pho Soup Chicken.', 285.0, 4.6, 1],\n",
       " ['Tom Yum Veg.', 285.0, 4.9, 1],\n",
       " ['Miso Soup Chicken.', 285.0, 5.0, 1],\n",
       " ['Chicken Hunan Curry with Noodles', 280.0, 1.5, 1],\n",
       " ['Dragon Soft Chicken Chop suey', 280.0, 2.5, 1],\n",
       " ['Dragon Crispy Chicken Chop suey', 280.0, 3.7, 1],\n",
       " ['Chicken Chilli Garlic Curry with Noodles', 280.0, 3.8, 1],\n",
       " ['Pork Steamed Momos (10 Pieces)', 280.0, 4.0, 1],\n",
       " ['Chicken Leefu Curry with Rice', 280.0, 4.2, 1],\n",
       " ['Chicken Thai Curry with Rice', 280.0, 4.3, 1],\n",
       " ['American Chicken Crispy Chop suey', 280.0, 4.4, 1],\n",
       " ['Chinese Chicken Crispy Chop suey', 280.0, 4.6, 1],\n",
       " ['Pork sausage', 280.0, 4.6, 1],\n",
       " ['Seafood Dragon Roll (10 Pieces)', 280.0, 4.6, 1],\n",
       " ['Mixed Noodles', 280.0, 4.6, 1],\n",
       " ['Chicken Thai Curry with Noodles', 280.0, 4.7, 1],\n",
       " ['Chicken Steamed Curry with Rice', 280.0, 4.7, 1],\n",
       " ['American Chicken Soft Chop suey', 280.0, 4.8, 1],\n",
       " ['Chicken Chilli Garlic Curry with Rice', 280.0, 4.9, 1],\n",
       " ['Chicken Canton Curry with Rice', 280.0, 5.0, 1],\n",
       " ['Chicken Hunan Curry with Rice', 280.0, 5.0, 1],\n",
       " ['Chinese Chicken Soft Chop suey', 280.0, 5.0, 1],\n",
       " ['Chicken Leefu Curry with Noodles', 280.0, 5.0, 1],\n",
       " ['Chicken Canton Curry with Noodles', 280.0, 5.0, 1],\n",
       " ['Pork Mustard Momo (10 Pic)', 280.0, 5.0, 1],\n",
       " ['Chicken Triple Schezwan Steamed Rice', 279.0, 2.7, 1],\n",
       " ['Veg Khao Phad Kapro', 279.0, 3.4, 1],\n",
       " ['Veg Phad Ki Mao', 279.0, 3.9, 1],\n",
       " ['Chicken Schezwan Steamed Rice - Koithio', 279.0, 3.9, 1],\n",
       " ['Chicken Szechuan Rice Bowl', 279.0, 4.0, 1],\n",
       " ['Mapo Tofu And Burnt Garlic Fried Rice Bowl', 279.0, 4.0, 1],\n",
       " ['Chicken Danmein Noodle Bowl', 279.0, 4.3, 1],\n",
       " ['Chicken Koithai Bowl', 279.0, 4.6, 1],\n",
       " ['Chicken Chilli Garlic Rice Bowl', 279.0, 4.6, 1],\n",
       " ['Chicken Hunan Steamed Rice - Koithio', 279.0, 4.9, 1],\n",
       " ['Chicken Thai Curry Bowl', 279.0, 4.9, 1],\n",
       " ['Basil Fried Rice', 279.0, 5.0, 1],\n",
       " ['Veg Thukpa', 277.0, 3.15, 2],\n",
       " ['Nepali Style Chicken Noodles', 275.0, 3.5, 1],\n",
       " ['8 Treasure Chicken Fried Rice', 275.0, 3.8, 1],\n",
       " ['Khaow Pad Ka Thiem', 275.0, 4.0, 1],\n",
       " ['Lemon Coriander Soup Chicken.', 275.0, 4.0, 1],\n",
       " ['Burnt  Garlic Chicken Noodles', 275.0, 4.4, 1],\n",
       " ['Szechuan Chicken Noodles', 275.0, 4.9, 1],\n",
       " ['Hakka Chicken Noodle', 275.0, 5.0, 1],\n",
       " ['Mixed Fried Rice', 274.5, 4.55, 2],\n",
       " ['Mixed Cantonese Noodles', 270.0, 4.0, 1],\n",
       " ['Seafood Fried Wontons ( 10 Pieces)', 270.0, 5.0, 1],\n",
       " ['Veg Danmein Noodles Bowl', 269.0, 3.6, 1],\n",
       " ['Veg Triple Schezwan Steamed Rice', 269.0, 3.9, 1],\n",
       " ['Chicken Chinese Chopsuey', 269.0, 4.2, 1],\n",
       " ['Mixed Schezwan Noodles', 269.0, 4.3, 1],\n",
       " ['Veg Schezwan Steamed Rice - Koithio', 269.0, 4.3, 1],\n",
       " ['Prawns Fried Rice', 269.0, 4.4, 1],\n",
       " ['Veg Dragon Roll', 269.0, 4.4, 1],\n",
       " ['Veg Steamed Momos', 269.0, 4.6, 1],\n",
       " ['Veg Hunan Steamed Rice - Koithio', 269.0, 4.6, 1],\n",
       " ['Veg Szechuan Rice Bowl', 269.0, 4.6, 1],\n",
       " ['Mixed Chow Mein', 269.0, 4.6, 1],\n",
       " ['Veg Thai Curry Bowl', 269.0, 4.7, 1],\n",
       " ['Mixed Schezwan Fried Rice', 269.0, 4.7, 1],\n",
       " ['Crispy Crunchy Spinach', 269.0, 4.7, 1],\n",
       " ['Veg Fried Wonton', 269.0, 4.8, 1],\n",
       " ['Veg Chilli Garlic Rice Bowl', 269.0, 4.8, 1],\n",
       " ['Veg Schezwan Steamed Rice', 269.0, 4.9, 1],\n",
       " ['Chicken Steamed Rice - Koithio', 269.0, 4.9, 1],\n",
       " ['Veg Koithai Bowl', 269.0, 5.0, 1],\n",
       " ['Veg Steamed Rice', 269.0, 5.0, 1],\n",
       " ['Veg Stewed Rice', 269.0, 5.0, 1],\n",
       " ['Veg Hunan Steamed Rice', 269.0, 5.0, 1],\n",
       " ['Keema Noodels Chicken', 265.0, 3.4, 1],\n",
       " ['Lifu Chicken Noodles', 265.0, 4.4, 1],\n",
       " ['Ice Longan', 265.0, 4.9, 1],\n",
       " ['Chicken Chow mein with Curry', 260.0, 4.3, 1],\n",
       " ['Nang Kai Tod', 260.0, 4.4, 1],\n",
       " ['Chicken Dragon Roll (10 Pieces)', 260.0, 4.6, 1],\n",
       " ['Chicken Spring Roll (2 Pieces)', 260.0, 4.9, 1],\n",
       " ['Chicken Fried Wontons (10 Pieces)', 260.0, 4.9, 1],\n",
       " ['Chicken Fried Rice', 259.666666666667, 3.93333333333333, 3],\n",
       " ['Tibetan Prawn Steamed Momo (5 Pcs)', 259.0, 1.5, 1],\n",
       " ['Chicken Tom Yum Fried Rice', 259.0, 4.0, 1],\n",
       " ['Chicken Chilli Garlic Rice', 259.0, 4.3, 1],\n",
       " ['Chicken Butter Garlic Rice', 259.0, 4.3, 1],\n",
       " ['Mixed Koithio', 259.0, 4.4, 1],\n",
       " ['Prawns Schezwan Noodles', 259.0, 4.4, 1],\n",
       " ['Chicken Schezwan Fried Rice', 259.0, 4.4, 1],\n",
       " ['Prawns Koithio', 259.0, 4.5, 1],\n",
       " ['Chicken Ginger Capsicum Rice', 259.0, 4.6, 1],\n",
       " ['Chicken Shanghai Fried Rice', 259.0, 4.7, 1],\n",
       " ['Chicken Leefu Rice', 259.0, 4.8, 1],\n",
       " ['Butter Garlic Chicken Fried Rice', 257.5, 3.95, 2],\n",
       " ['Alu Dum Wai Wai', 255.0, 3.7, 1],\n",
       " ['Alu Dum Sel Roti', 255.0, 3.8, 1],\n",
       " ['Chicken Sekuwa', 255.0, 3.9, 1],\n",
       " ['Chicken Choyila', 255.0, 4.5, 1],\n",
       " ['Vietnamese Pho Soup Veg.', 255.0, 4.6, 1],\n",
       " ['Laping Wai Wai', 255.0, 4.6, 1],\n",
       " ['Chicken Cantonese Noodles', 255.0, 4.6, 1],\n",
       " ['Steamed Jasmine Rice.', 255.0, 5.0, 1],\n",
       " ['Veg Spring Roll', 254.666666666667, 3.93333333333333, 3],\n",
       " ['Szechuan Egg Fried Rice', 250.0, 1.8, 1],\n",
       " ['Veg Hunan Curry with Rice', 250.0, 2.5, 1],\n",
       " ['Veg Thai Curry with Rice', 250.0, 2.5, 1],\n",
       " ['Szechuan Egg Noodles', 250.0, 2.6, 1],\n",
       " ['Veg Thai Curry with Noodles', 250.0, 3.5, 1],\n",
       " ['Veg Chow mein with Curry', 250.0, 3.5, 1],\n",
       " ['Brocolli With Cheese Egg Fried Rice', 250.0, 3.6, 1],\n",
       " ['Chinese Crispy Chop suey', 250.0, 3.9, 1],\n",
       " ['Dragon Soft Chop suey', 250.0, 4.0, 1],\n",
       " ['Dragon Crispy Chop suey', 250.0, 4.0, 1],\n",
       " ['8 Treasure Egg Fried Rice', 250.0, 4.0, 1],\n",
       " ['American Crispy Chop suey', 250.0, 5.0, 1],\n",
       " ['Veg Steamed Curry with Rice', 250.0, 5.0, 1],\n",
       " ['Butter Garlic Egg Fried Rice', 250.0, 5.0, 1],\n",
       " ['Veg Chilli Garlic Curry with Rice', 250.0, 5.0, 1],\n",
       " ['Pork Thukpa Soup', 250.0, 5.0, 1],\n",
       " ['Veg Chilli Garlic Curry with Noodles', 250.0, 5.0, 1],\n",
       " ['Veg Dragon Chopsuey', 249.0, 3.7, 1],\n",
       " ['Veg American Chopsuey', 249.0, 3.9, 1],\n",
       " ['Veg Chilli Garlic Rice', 249.0, 4.3, 1],\n",
       " ['Chicken Singapore Noodles', 249.0, 4.3, 1],\n",
       " ['Chicken Chilli Garlic Chow Mein', 249.0, 4.3, 1],\n",
       " ['Spicy Crispy Chicken Bao', 249.0, 4.4, 1],\n",
       " ['Chicken Danmein Noodles', 249.0, 4.4, 1],\n",
       " ['Prawns Noodles', 249.0, 4.4, 1],\n",
       " ['Veg Butter Garlic Rice', 249.0, 4.4, 1],\n",
       " ['Egg Schezwan Fried Rice', 249.0, 4.5, 1],\n",
       " ['Veg Leefu Rice', 249.0, 4.5, 1],\n",
       " ['Chicken Schezwan Noodles', 249.0, 4.5, 1],\n",
       " ['Chicken Oriental Salad', 249.0, 4.5, 1],\n",
       " ['Egg Fried Rice', 249.0, 4.5, 1],\n",
       " ['Veg Chinese Chopsuey', 249.0, 4.7, 1],\n",
       " ['Veg Tom Yum Fried Rice', 249.0, 5.0, 1],\n",
       " ['Veg Ginger Capsicum Rice', 249.0, 5.0, 1],\n",
       " ['Veg Cantonese Noodles', 245.0, 4.2, 1],\n",
       " ['Lemon Coriander Soup Veg.', 245.0, 5.0, 1],\n",
       " ['Veg Dragon Roll (10 Pieces)', 240.0, 2.1, 1],\n",
       " ['Bamboo Shoots Chicken Fried Rice', 240.0, 2.4, 1],\n",
       " ['Potato Chilli Gravy', 240.0, 2.4, 1],\n",
       " ['Chilli Baby corn Dry', 240.0, 2.7, 1],\n",
       " ['Chilli Garlic Chicken Fried Rice', 240.0, 2.9, 1],\n",
       " ['Mushroom Manchurian Dry', 240.0, 3.5, 1],\n",
       " ['M . R . N. Special  Chicken Fried Rice', 240.0, 3.5, 1],\n",
       " ['Ginger Chicken Fried Rice', 240.0, 3.6, 1],\n",
       " ['Honey Chilli Potato Dry', 240.0, 3.7, 1],\n",
       " ['Chicken Mushroom Fried Rice', 240.0, 3.7, 1],\n",
       " ['Mushroom Chilli Dry', 240.0, 3.8, 1],\n",
       " ['Vegetable Manchurian Gravy', 240.0, 3.9, 1],\n",
       " ['Chilli Baby corn Gravy', 240.0, 4.0, 1],\n",
       " ['Fresh Mushroom in Garlic Gravy', 240.0, 4.0, 1],\n",
       " ['Roasted Corn Chicken Noodles', 240.0, 4.0, 1],\n",
       " ['Roasted Corn Chicken Fried Rice', 240.0, 4.0, 1],\n",
       " ['Schezwan Chicken Noodles', 240.0, 4.0, 1],\n",
       " ['Roasted Broccoli Chicken Noodles', 240.0, 4.1, 1],\n",
       " ['Roasted Paneer Chicken Noodles', 240.0, 4.1, 1],\n",
       " ['Mushroom Manchurian Gravy', 240.0, 4.1, 1],\n",
       " ['Mushroom Chilli Gravy', 240.0, 4.2, 1],\n",
       " ['Gobi Manchurian Dry', 240.0, 4.3, 1],\n",
       " ['Golden Fried Baby corn Dry', 240.0, 4.3, 1],\n",
       " ['Sweet Corn Chilli Garlic Chicken Noodles', 240.0, 4.4, 1],\n",
       " ['Crispy Chilli Sweet corn Dry', 240.0, 4.4, 1],\n",
       " ['Chilli Garlic Chicken Noodles', 240.0, 4.5, 1],\n",
       " ['Potato Chilli Dry', 240.0, 4.5, 1],\n",
       " ['Chicken Noodles', 240.0, 4.5, 1],\n",
       " ['Schezwan Egg & Chicken Fried Rice', 240.0, 4.6, 1],\n",
       " ['Bua Loy Khai-wan', 240.0, 4.6, 1],\n",
       " ['Singapore Chicken Fried Rice', 240.0, 4.7, 1],\n",
       " ['Roasted Paneer Chicken Fried Rice', 240.0, 4.7, 1],\n",
       " ['Butter Garlic Chicken Noodles', 240.0, 4.7, 1],\n",
       " ['M. R. N.  Special Chicken Noodles', 240.0, 4.8, 1],\n",
       " ['Gobi Manchurian Gravy', 240.0, 4.9, 1],\n",
       " ['Schezwan Chicken Fried Rice', 240.0, 4.9, 1],\n",
       " ['Singapore Chicken Noodles', 240.0, 4.9, 1],\n",
       " ['Mushroom Pepper Salt Dry', 240.0, 4.9, 1],\n",
       " ['Shanghai Chicken Fried Rice', 240.0, 4.9, 1],\n",
       " ['Chilli Crispy Veg Dry', 240.0, 5.0, 1],\n",
       " ['Roasted Broccoli Chicken Fried Rice', 240.0, 5.0, 1],\n",
       " ['Schezwan Egg & Veg Fried Rice', 240.0, 5.0, 1],\n",
       " ['Sweet corn Chilli Garlic Chicken Fried Rice', 240.0, 5.0, 1],\n",
       " ['Crispy Leefu Potato Dry', 240.0, 5.0, 1],\n",
       " ['Vegetable Manchurian Dry', 240.0, 5.0, 1],\n",
       " ['Bamboo Shoots Chicken Noodles', 240.0, 5.0, 1],\n",
       " ['Ginger Chicken Noodles', 240.0, 5.0, 1],\n",
       " ['Fresh Mushroom in Garlic Dry', 240.0, 5.0, 1],\n",
       " ['Chicken Mushroom Noodles', 240.0, 5.0, 1],\n",
       " ['Chicken Koithio', 239.0, 4.3, 1],\n",
       " ['Veg Shanghai Fried Rice', 237.0, 4.3, 2],\n",
       " ['Veg Schezwan Fried Rice', 237.0, 4.65, 2],\n",
       " ['Mixed Tom Kha Phak', 235.0, 4.0, 1],\n",
       " ['Mixed Tom Yam', 235.0, 4.0, 1],\n",
       " ['Veg Steamed Rice - Koithio', 235.0, 4.7, 1],\n",
       " ['Veg Fried Rice', 234.666666666667, 4.23333333333333, 3],\n",
       " ['Laping Veg', 230.0, 3.7, 1],\n",
       " ['Mixed Fu Yung', 230.0, 4.9, 1],\n",
       " ['Veg Koithio', 229.0, 3.8, 1],\n",
       " ['Chicken Chilli Chow Mein', 229.0, 3.9, 1],\n",
       " ['Egg Koithio', 229.0, 4.3, 1],\n",
       " ['Chicken Chow Mein', 229.0, 4.3, 1],\n",
       " ['Chicken Butter Garlic Noodles', 229.0, 4.3, 1],\n",
       " ['Veg Schezwan Noodles', 229.0, 4.4, 1],\n",
       " ['Veg Chilli Garlic Chow Mein', 229.0, 4.4, 1],\n",
       " ['Veg Danmein Noodles', 229.0, 4.4, 1],\n",
       " ['Chicken Hakka Noodles', 229.0, 4.4, 1],\n",
       " ['Chicken Leefu Noodles', 229.0, 4.5, 1],\n",
       " ['Chicken Meifoon', 229.0, 4.6, 1],\n",
       " ['Veg Singapore Noodles', 227.0, 4.2, 2],\n",
       " ['Veg Ginger Fried Rice', 225.0, 1.5, 1],\n",
       " ['Veg M . R. N. Special Veg Noodles', 225.0, 1.7, 1],\n",
       " ['Veg Chilli Garlic Noodles', 225.0, 2.5, 1],\n",
       " ['Veg Mushroom Noodles', 225.0, 3.8, 1],\n",
       " ['Veg Butter Garlic Fried Rice', 225.0, 3.9, 1],\n",
       " ['Egg Hakka Noodles', 225.0, 4.0, 1],\n",
       " ['Veg Sweet corn Chilli Garlic Fried Rice', 225.0, 4.2, 1],\n",
       " ['Prawns Lemon Grass Soup', 225.0, 4.6, 1],\n",
       " ['Egg Butter Garlic Noodles', 225.0, 4.6, 1],\n",
       " ['Veg Roasted Paneer Noodles', 225.0, 4.6, 1],\n",
       " ['Veg Roasted Broccoli Noodles', 225.0, 4.6, 1],\n",
       " ['Veg Noodles', 225.0, 4.8, 1],\n",
       " ['Veg Chilli Garlic Fried Rice', 225.0, 4.9, 1],\n",
       " ['Veg Roasted Paneer Fried Rice', 225.0, 5.0, 1],\n",
       " ['Veg Sweet corn Chilli Garlic Noodles', 225.0, 5.0, 1],\n",
       " ['Veg Mushroom Fried Rice', 225.0, 5.0, 1],\n",
       " ['Veg Roasted Broccoli Fried Rice', 225.0, 5.0, 1],\n",
       " ['Veg Hakka Noodles', 224.5, 4.3, 2],\n",
       " ['Veg Butter Garlic Noodles', 222.0, 4.65, 2],\n",
       " ['Szechuan Veg Noodles', 220.0, 2.4, 1],\n",
       " ['Nepali Style Veg Noodles', 220.0, 3.9, 1],\n",
       " ['8 Treasure Veg Fried Rice', 220.0, 3.9, 1],\n",
       " ['Singapore Style Veg Noodles', 220.0, 4.0, 1],\n",
       " ['Egg Schezwan Noodles', 220.0, 4.3, 1],\n",
       " ['Burnt Garlic Veg Noodles', 220.0, 4.5, 1],\n",
       " ['Szechuan Veg Fried Rice', 220.0, 4.8, 1],\n",
       " ['Hakka Veg Noodle', 220.0, 4.8, 1],\n",
       " ['Butter Garlic Veg Fried Rice', 220.0, 4.9, 1],\n",
       " ['Egg Chowmein', 220.0, 5.0, 1],\n",
       " ['Broccoli With Cheese Fried Rice', 220.0, 5.0, 1],\n",
       " ['Veg Leefu Noodles', 219.0, 4.2, 1],\n",
       " ['Veg Chow Mein', 219.0, 4.4, 1],\n",
       " ['Veg Chilli Chow Mein', 219.0, 4.6, 1],\n",
       " ['Veg Meifoon', 219.0, 4.7, 1],\n",
       " ['Prawns Fu Yung', 215.0, 1.6, 1],\n",
       " ['Bua Loy', 215.0, 4.2, 1],\n",
       " ['Alu Sandheko', 215.0, 4.2, 1],\n",
       " ['Tub-tim Grob', 215.0, 4.3, 1],\n",
       " ['Chicken Steam  Momos (10 Pieces)', 215.0, 4.5, 1],\n",
       " ['Chicken Crispy Honey Spicy Momo ( 10 Pieces)', 215.0, 4.5, 1],\n",
       " ['Lifu Veg Noodles', 215.0, 4.6, 1],\n",
       " ['Sausage Tareko', 215.0, 4.6, 1],\n",
       " ['Chicken Fried  Momo (10 Pieces)', 215.0, 4.7, 1],\n",
       " ['Mustard Chicken Momo (10 Pcs)', 215.0, 4.8, 1],\n",
       " ['Chicken Crispy Schezwan Momo (10 Pieces)', 215.0, 4.8, 1],\n",
       " ['Thai Chicken B S Soup', 215.0, 4.9, 1],\n",
       " ['Smoked Chicken Momo (10 Pcs)', 215.0, 4.9, 1],\n",
       " ['Lemon Grass Chicken Momo (10 Pcs)', 215.0, 5.0, 1],\n",
       " ['Chicken With Bean Sprouts', 210.0, 4.0, 1],\n",
       " ['Kimchi Chicken Steam Momo (5 Pcs)', 209.0, 2.3, 1],\n",
       " ['Spicy Crispy Paneer Bao', 209.0, 3.6, 1],\n",
       " ['Wai Wai Sandheko Veggie', 205.0, 4.3, 1],\n",
       " ['Chicken Fu Yung', 205.0, 5.0, 1],\n",
       " ['Chicken Salad', 200.0, 2.2, 1],\n",
       " ['Buff innards', 200.0, 4.8, 1],\n",
       " ['Chicken fried rice', 199.0, 2.6, 1],\n",
       " ['Alungsa offal meat', 199.0, 4.4, 1],\n",
       " ['Veg Manchow Soup', 196.666666666667, 4.5, 3],\n",
       " ['Veg Fried Wontons', 195.0, 1.6, 1],\n",
       " ['Prawns Manchow Soup', 195.0, 1.9, 1],\n",
       " ['Seafood Sweet corn Soup', 195.0, 3.0, 1],\n",
       " ['Seafood Rice Noodles Soup', 195.0, 3.0, 1],\n",
       " ['Seafood Thukpa Noodles Soup', 195.0, 3.0, 1],\n",
       " ['Veg Schezwan Crispy  Momo (10 Pieces)', 195.0, 3.2, 1],\n",
       " ['Crab Hot Sour Soup', 195.0, 3.3, 1],\n",
       " ['Seafood Manchow Soup', 195.0, 3.8, 1],\n",
       " ['Chicken Talumein Soup', 195.0, 3.9, 1],\n",
       " ['Chicken Lemon Coriander Soup', 195.0, 4.0, 1],\n",
       " ['Chicken Tom Kha Phak', 195.0, 4.0, 1],\n",
       " ['Veg Crispy Honey Spicy Momo (10 Pieces)', 195.0, 4.2, 1],\n",
       " ['Chicken Lemon Pepper Soup', 195.0, 4.3, 1],\n",
       " ['Veg Steam  Momos (10 Pieces)', 195.0, 4.4, 1],\n",
       " ['Chicken Hunan Wonton Soup', 195.0, 4.5, 1],\n",
       " ['Chicken Noodles Soup', 195.0, 4.6, 1],\n",
       " ['Seafood Mushroom Soup', 195.0, 4.6, 1],\n",
       " ['Chicken Sweet Corn Soup', 195.0, 4.6, 1],\n",
       " ['Chicken Hot & Sour Soup', 195.0, 4.6, 1],\n",
       " ['Chicken Crispy Rice Soup', 195.0, 4.7, 1],\n",
       " ['Chicken Coriander Soup', 195.0, 4.7, 1],\n",
       " ['Chicken Jade Corn Soup', 195.0, 4.7, 1],\n",
       " ['Chicken Tom Yam', 195.0, 4.9, 1],\n",
       " ['Veg Fried Momo (10 Pieces)', 195.0, 4.9, 1],\n",
       " ['Smoked Veg Momo (10 Pcs)', 195.0, 4.9, 1],\n",
       " ['Fish Manchow Soup', 195.0, 5.0, 1],\n",
       " ['Fish Meatballs Soup', 195.0, 5.0, 1],\n",
       " ['Seafood Mushroom Clear Soup', 195.0, 5.0, 1],\n",
       " ['Chicken Lung Fung Soup', 190.0, 3.4, 2],\n",
       " ['Chicken Wonton Soup', 190.0, 4.3, 2],\n",
       " ['Chicken Manchow Soup', 190.0, 4.65, 2],\n",
       " ['Khaow Greb Kung', 190.0, 5.0, 1],\n",
       " ['Chicken Basil Steam Momo (5 Pcs)', 189.0, 4.3, 1],\n",
       " ['Veg Noodles Soup', 185.0, 3.4, 1],\n",
       " ['Chicken Tom Yum Soup', 185.0, 3.5, 1],\n",
       " ['Chicken Rice Noodles Soup', 185.0, 3.6, 1],\n",
       " ['Veg Tom Yam', 185.0, 4.0, 1],\n",
       " ['Chicken Mushroom Clear Soup', 185.0, 4.2, 1],\n",
       " ['Veg Lemon Pepper Soup', 185.0, 4.3, 1],\n",
       " ['Veg Jade Corn Soup', 185.0, 4.3, 1],\n",
       " ['Veg Talumein Soup', 185.0, 4.3, 1],\n",
       " ['Aloo Tareko', 185.0, 4.4, 1],\n",
       " ['Veg Coriander Soup', 185.0, 4.4, 1],\n",
       " ['Chicken Thukpa Noodles Soup', 185.0, 4.4, 1],\n",
       " ['Alu Ko Achar', 185.0, 4.5, 1],\n",
       " ['Veg Hot & Sour Soup', 185.0, 4.6, 1],\n",
       " ['Chicken Sweet corn Soup', 185.0, 4.8, 1],\n",
       " ['Veg Tom Kha Phak', 185.0, 4.9, 1],\n",
       " ['Broccoli Lemon Pepper Chicken Soup', 185.0, 4.9, 1],\n",
       " ['Chicken Meatballs Soup', 185.0, 4.9, 1],\n",
       " ['Chicken Hot Sour Soup', 185.0, 4.9, 1],\n",
       " ['Veg Crispy Rice Soup', 185.0, 5.0, 1],\n",
       " ['Veg Hunan Wonton Soup', 185.0, 5.0, 1],\n",
       " ['Bamboo Shoot Clear Chicken Soup', 185.0, 5.0, 1],\n",
       " ['Chicken Lollipop ( 3 Pic)', 180.0, 3.8, 1],\n",
       " ['Chocolate Roll with Ice Cream', 180.0, 4.4, 1],\n",
       " ['Veg Pan Fried Momo (5 Pcs)', 179.0, 4.1, 1],\n",
       " ['Kalimpong Chicken Steam Momo (5 Pcs)', 179.0, 4.3, 1],\n",
       " ['Veg Lung Fung Soup', 175.0, 3.55, 2],\n",
       " ['Veg Sweet Corn Soup', 175.0, 4.45, 2],\n",
       " ['Veg Wonton Soup', 170.0, 4.65, 2],\n",
       " ['Bamboo Shoot Clear Veg Soup', 165.0, 3.0, 1],\n",
       " ['Veg Tom Yum Soup', 165.0, 4.0, 1],\n",
       " ['Veg Mushroom Clear Soup', 165.0, 4.1, 1],\n",
       " ['Veg Thukpa Noodles Soup', 165.0, 4.1, 1],\n",
       " ['Veg Hot Sour Soup', 165.0, 4.3, 1],\n",
       " ['Veg Rice Noodles Soup', 165.0, 5.0, 1],\n",
       " ['Veg Mushroom Soup', 165.0, 5.0, 1],\n",
       " ['Broccoli Lemon Pepper Veg Soup', 165.0, 5.0, 1],\n",
       " ['Steamed sticky rice', 160.0, 4.2, 1],\n",
       " ['Tomato Soup', 155.0, 1.5, 1],\n",
       " ['Steamed Basmati Rice', 150.0, 4.9, 1],\n",
       " ['Veg chowmein', 150.0, 5.0, 1],\n",
       " ['Veg Steam Momo (5 Pcs)', 139.0, 4.0, 1],\n",
       " ['Chicken Steam Momo (6 Pic)', 135.0, 4.6, 1],\n",
       " ['Plain Steamed Rice', 129.0, 5.0, 1],\n",
       " ['Veg Salad', 120.0, 1.7, 1],\n",
       " ['Veg Steam Momo (6 Pic)', 120.0, 2.8, 1],\n",
       " ['Date Pancake', 120.0, 3.6, 1],\n",
       " ['Kimchi Salad', 120.0, 3.7, 1],\n",
       " ['Plain rice', 120.0, 4.2, 1],\n",
       " ['Chole bhature [2 pieces]', 95.0, 3.8, 1],\n",
       " ['Khaow Suai', 90.0, 4.7, 1],\n",
       " ['Wai wai salad', 80.0, 3.6, 1],\n",
       " ['Tata Alkaline 1 Ltr', 60.0, 4.1, 1],\n",
       " ['Boiled veggies', 59.0, 4.0, 1],\n",
       " ['Ooti', 59.0, 4.5, 1],\n",
       " ['Chutney', 49.0, 3.3, 1],\n",
       " ['Lime Soda', 45.0, 4.1, 1]]"
      ]
     },
     "execution_count": 295,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "f_params = {\n",
    "    'q_params': {\n",
    "        \"area\": 'Koramangala',\n",
    "        \"cuisine\": 'Thai',\n",
    "        \"min_listings\": 1,\n",
    "        \"limit\": 1000,\n",
    "    },\n",
    "    \"output\": 'dict',\n",
    "    \"exclude\": {}\n",
    "}\n",
    "\n",
    "data = get_overpriced_menu(**f_params)\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 296,
   "id": "a83ea0b1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "930"
      ]
     },
     "execution_count": 296,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "af4a1cab",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
