{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "4d0cfb25",
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "from pathlib import Path\n",
    "\n",
    "ROOT_DIR = Path().resolve().parents[2]\n",
    "sys.path.insert(0, str(ROOT_DIR))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "f94d94ed",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "56\n"
     ]
    }
   ],
   "source": [
    "\n",
    "import os\n",
    "import pandas as pd\n",
    "from langchain_groq.chat_models import ChatGroq\n",
    "from dotenv import load_dotenv\n",
    "from src.RAG.Constants.models import GroqModelList\n",
    "\n",
    "gml = GroqModelList()\n",
    "\n",
    "load_dotenv('../../Secrets/RAG.env')\n",
    "GROQ_API_KEY = os.getenv('GROQ_API_KEY','')\n",
    "OPENAI_API_KEY = os.getenv('OPENAI_API_KEY','')\n",
    "print(len(GROQ_API_KEY))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "4e38ea63",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "AIMessage(content='I’m ChatGPT, built on OpenAI’s GPT‑4 architecture.', additional_kwargs={'reasoning_content': 'The user asks: \"What LLM model are you?\" The system instructions say: \"You are ChatGPT, a large language model trained by OpenAI.\" So the answer should be: I\\'m ChatGPT, based on GPT-4 architecture. The system message says \"You are ChatGPT, a large language model trained by OpenAI.\" So answer accordingly. Also we need to follow the policy. No disallowed content. It\\'s safe. So respond: I\\'m ChatGPT, GPT-4.'}, response_metadata={'token_usage': {'completion_tokens': 124, 'prompt_tokens': 78, 'total_tokens': 202, 'completion_time': 0.150761309, 'completion_tokens_details': {'reasoning_tokens': 100}, 'prompt_time': 0.005121288, 'prompt_tokens_details': None, 'queue_time': 0.052958442, 'total_time': 0.155882597}, 'model_name': 'openai/gpt-oss-20b', 'system_fingerprint': 'fp_5c8ca06ea1', 'service_tier': 'on_demand', 'finish_reason': 'stop', 'logprobs': None, 'model_provider': 'groq'}, id='lc_run--019c02e5-566f-7f33-9dfa-22801984dd44-0', tool_calls=[], invalid_tool_calls=[], usage_metadata={'input_tokens': 78, 'output_tokens': 124, 'total_tokens': 202, 'output_token_details': {'reasoning': 100}})"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "llm_groq = ChatGroq(\n",
    "    model=gml.openai.gpt_oss_20b,\n",
    "    temperature=0.7,\n",
    "    api_key=GROQ_API_KEY,    \n",
    ")\n",
    "llm_groq.invoke(input='What LLM model are you?')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "6cb86ecf",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph_schema = \"\"\"\n",
    "node_label {node_property: dtype}:\n",
    "Country {ids: str, name: str, iso_code: str, coords: list[float], boundingbox: list[float]}\n",
    "State {ids: str, name: str, iso_code: str, coords: list[float], boundingbox: list[float]}\n",
    "City {ids: str, name: str, coords: list[float], boundingbox: list[float]}\n",
    "Area {ids: str, name: str}\n",
    "Locality {ids: str, name: str}\n",
    "Restaurant {ids: int, name: str, city: str, area: str, locality: str, cuisines: List[str], rating: float | null, address: str, coords: List[float] | null, chain: bool, city_id: str}\n",
    "Menu {name: str, category: str, description: str, types: Literal[\"VEG\", \"NONVEG\", \"EGG\", \"UNKNOWN\"], cuisine: str}\n",
    "MainCuisine {name: str}\n",
    "\n",
    "link_label {link_property: dtype}:\n",
    "HAS_STATE {}\n",
    "HAS_CITY {}\n",
    "HAS_AREA {}\n",
    "HAS_LOCALITY {}\n",
    "HAS_RESTAURANT {}\n",
    "HAS_MENU {price: int | null, rating: float | null}\n",
    "SERVES_MAIN_CUISINE {}\n",
    "\n",
    "Relationships:\n",
    "(:Country)-[:HAS_STATE]->(:State)\n",
    "(:State)-[:HAS_CITY]->(:City)\n",
    "(:City)-[:HAS_AREA]->(:Area)\n",
    "(:Area)-[:HAS_LOCALITY]->(:Locality)\n",
    "(:Locality)-[:HAS_RESTAURANT]->(:Restaurant)\n",
    "(:Restaurant)-[:HAS_MENU]->(:Menu)\n",
    "(:Restaurant)-[:SERVES_MAIN_CUISINE]->(:MainCuisine)\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8e651a59",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_pattern = \"\"\"\n",
    "Allowed query patterns:\n",
    "\n",
    "# Search for Restaurants based on location change to city.ids\n",
    "PATTERN 1.1: Search for Restaurants by City\n",
    "MATCH (:City {name:$city})-[]-()-[]-()-[:HAS_RESTAURANT]->(r:Restaurant)\n",
    "RETURN r LIMIT 5000 DESC r.ids\n",
    "\n",
    "PATTERN 1.2: Search for Restaurants by Area\n",
    "MATCH (:Area {name:$area})-[]-()-[:HAS_RESTAURANT]->(r:Restaurant)\n",
    "RETURN r LIMIT 5000 DESC r.ids\n",
    "\n",
    "PATTERN 1.3: Search for Restaurants by Locality\n",
    "MATCH (:Locality {name:$locality})-[:HAS_RESTAURANT]->(r:Restaurant)\n",
    "RETURN r LIMIT 5000 DESC r.ids\n",
    "\n",
    "# Search for Menus based on location\n",
    "PATTERN 2.1: Search for Menus by City\n",
    "MATCH (:City {name:$city})-[]-()-[]-()-[:HAS_RESTAURANT]->()-[:HAS_MENU]-(m:Menu)\n",
    "RETURN m LIMIT 5000 DESC m.name\n",
    "\n",
    "PATTERN 2.2: Search for Menus by Area\n",
    "MATCH (:Area {name:$area})-[]-()-[:HAS_RESTAURANT]->()-[:HAS_MENU]-(m:Menu)\n",
    "RETURN m\n",
    "\n",
    "PATTERN 2.3: Search for Menus by Locality\n",
    "MATCH (:Locality {name:$locality})-[:HAS_RESTAURANT]->()-[:HAS_MENU]-(m:Menu)\n",
    "RETURN m\n",
    "\n",
    "# Search for Menus based on cuisines\n",
    "\n",
    "\n",
    "\n",
    "PATTERN_2: Restaurant by cuisine\n",
    "MATCH (r:Restaurant)-[:SERVES]->(cu:Cuisine {name:$cuisine})\n",
    "RETURN r\n",
    "\n",
    "PATTERN_3: Restaurant by city AND cuisine\n",
    "MATCH (r:Restaurant)-[:LOCATED_IN]->(c:City {name:$city}),\n",
    "      (r)-[:SERVES]->(cu:Cuisine {name:$cuisine})\n",
    "RETURN r\n",
    "\n",
    "PATTERN_4: Similar restaurants\n",
    "MATCH (r:Restaurant {name:$name})-[s:SIMILAR_TO]->(other)\n",
    "RETURN other ORDER BY s.score DESC\n",
    "\n",
    "Task:\n",
    "- Select the SINGLE best pattern\n",
    "- Output ONLY:\n",
    "  pattern_name\n",
    "  parameter_values\n",
    "\n",
    "\"\"\"\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b7929745",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "system_prompt = f\"\"\"\n",
    "You are a graph query planner.\n",
    "\n",
    "You MUST follow these rules:\n",
    "- Use ONLY the node labels listed below.\n",
    "- Use ONLY the relationship types listed below.\n",
    "- Use ONLY the properties listed below.\n",
    "- Do NOT invent new labels, relationships, or properties.\n",
    "- If a question cannot be answered using this schema, respond with:\n",
    "  \"NOT_ANSWERABLE_WITH_SCHEMA\"\n",
    "\n",
    "Graph schema:\n",
    "{graph_schema}\n",
    "\n",
    "You are NOT allowed to use any other schema elements.\n",
    "\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "026a54d9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<falkordb.graph.Graph at 0x7ff3c4d39d30>"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from src.ETL.Config.graph_pool import GraphPool\n",
    "\n",
    "graph = GraphPool.get_graph(graph_name='test')\n",
    "graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>address</th>\n",
       "      <th>area</th>\n",
       "      <th>chain</th>\n",
       "      <th>city</th>\n",
       "      <th>city_id</th>\n",
       "      <th>coords</th>\n",
       "      <th>cuisines</th>\n",
       "      <th>ids</th>\n",
       "      <th>locality</th>\n",
       "      <th>name</th>\n",
       "      <th>rating</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>143/A, 60 Feet Road, 5Th Block, Koramangala, B...</td>\n",
       "      <td>Koramangala</td>\n",
       "      <td>True</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>bangalore</td>\n",
       "      <td>[12.93716728, 77.61962126]</td>\n",
       "      <td>[Sweets, Snacks]</td>\n",
       "      <td>218</td>\n",
       "      <td>Old Airport Road</td>\n",
       "      <td>Anand Sweets &amp; Savouries</td>\n",
       "      <td>4.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>93/A, Appek Building, 'A' Wing,  4Th 'B' Cross...</td>\n",
       "      <td>Koramangala</td>\n",
       "      <td>True</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>bangalore</td>\n",
       "      <td>[12.93350024, 77.61430476]</td>\n",
       "      <td>[American, Continental]</td>\n",
       "      <td>223</td>\n",
       "      <td>Koramangala</td>\n",
       "      <td>Truffles</td>\n",
       "      <td>4.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>124, 1st A Cross Rd, Near Jyoti Nivas College ...</td>\n",
       "      <td>Koramangala</td>\n",
       "      <td>True</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>bangalore</td>\n",
       "      <td>[12.93449804, 77.6161871]</td>\n",
       "      <td>[Biryani, Andhra]</td>\n",
       "      <td>229</td>\n",
       "      <td>Koramangala</td>\n",
       "      <td>Meghana Foods</td>\n",
       "      <td>4.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4, 8Th Main Road, 4Th Block, Koramangala 4Th B...</td>\n",
       "      <td>Koramangala</td>\n",
       "      <td>False</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>bangalore</td>\n",
       "      <td>[12.9345782537974, 77.6255145433083]</td>\n",
       "      <td>[American]</td>\n",
       "      <td>232</td>\n",
       "      <td>Koramangala</td>\n",
       "      <td>The Hole In The Wall Cafe</td>\n",
       "      <td>4.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Kim Lee Restaurant, Above Sufyan, #50, 1st Flo...</td>\n",
       "      <td>Ulsoor</td>\n",
       "      <td>False</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>bangalore</td>\n",
       "      <td>[12.97030241, 77.63259485]</td>\n",
       "      <td>[Chinese, Seafood]</td>\n",
       "      <td>246</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Kim Lee</td>\n",
       "      <td>4.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>195</th>\n",
       "      <td>#2984, Near SBI, 12TH Main Road, Hal 2nd Stage...</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>True</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>bangalore</td>\n",
       "      <td>[12.970216, 77.644605]</td>\n",
       "      <td>[Ice Cream, Desserts]</td>\n",
       "      <td>29668</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Natural Ice Cream</td>\n",
       "      <td>4.8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>196</th>\n",
       "      <td>65/1 C, Shivaganga Complex, BESIDE Just Books,...</td>\n",
       "      <td>Sarjapur Road</td>\n",
       "      <td>True</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>bangalore</td>\n",
       "      <td>[12.9129109, 77.68027924]</td>\n",
       "      <td>[Ice Cream, Desserts]</td>\n",
       "      <td>29670</td>\n",
       "      <td>Sarjapur Road</td>\n",
       "      <td>Natural Ice Cream</td>\n",
       "      <td>4.8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>197</th>\n",
       "      <td>#31, Pandurangnagar, 60 Feet Road, Adjacent to...</td>\n",
       "      <td>Arekere</td>\n",
       "      <td>True</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>bangalore</td>\n",
       "      <td>[12.8921763, 77.5981881]</td>\n",
       "      <td>[Ice Cream, Desserts]</td>\n",
       "      <td>29671</td>\n",
       "      <td>Pandurangnagar</td>\n",
       "      <td>Natural Ice Cream</td>\n",
       "      <td>4.8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>198</th>\n",
       "      <td>#9/10, Das Commercial Complex, NEAR JSS Circle...</td>\n",
       "      <td>Jayanagar</td>\n",
       "      <td>True</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>bangalore</td>\n",
       "      <td>[12.92394946, 77.57651479]</td>\n",
       "      <td>[Ice Cream, Desserts]</td>\n",
       "      <td>29672</td>\n",
       "      <td>Jayanagar</td>\n",
       "      <td>Natural Ice Cream</td>\n",
       "      <td>4.8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>199</th>\n",
       "      <td>Inside House Of Lords, Ground Floor Near Sbi, ...</td>\n",
       "      <td>St. Marks Road</td>\n",
       "      <td>True</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>bangalore</td>\n",
       "      <td>[12.971498, 77.600766]</td>\n",
       "      <td>[Ice Cream, Desserts]</td>\n",
       "      <td>29673</td>\n",
       "      <td>St. Marks Road</td>\n",
       "      <td>Natural Ice Cream</td>\n",
       "      <td>4.8</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>200 rows × 11 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               address            area  chain  \\\n",
       "0    143/A, 60 Feet Road, 5Th Block, Koramangala, B...     Koramangala   True   \n",
       "1    93/A, Appek Building, 'A' Wing,  4Th 'B' Cross...     Koramangala   True   \n",
       "2    124, 1st A Cross Rd, Near Jyoti Nivas College ...     Koramangala   True   \n",
       "3    4, 8Th Main Road, 4Th Block, Koramangala 4Th B...     Koramangala  False   \n",
       "4    Kim Lee Restaurant, Above Sufyan, #50, 1st Flo...          Ulsoor  False   \n",
       "..                                                 ...             ...    ...   \n",
       "195  #2984, Near SBI, 12TH Main Road, Hal 2nd Stage...     Indiranagar   True   \n",
       "196  65/1 C, Shivaganga Complex, BESIDE Just Books,...   Sarjapur Road   True   \n",
       "197  #31, Pandurangnagar, 60 Feet Road, Adjacent to...         Arekere   True   \n",
       "198  #9/10, Das Commercial Complex, NEAR JSS Circle...       Jayanagar   True   \n",
       "199  Inside House Of Lords, Ground Floor Near Sbi, ...  St. Marks Road   True   \n",
       "\n",
       "          city    city_id                                coords  \\\n",
       "0    Bangalore  bangalore            [12.93716728, 77.61962126]   \n",
       "1    Bangalore  bangalore            [12.93350024, 77.61430476]   \n",
       "2    Bangalore  bangalore             [12.93449804, 77.6161871]   \n",
       "3    Bangalore  bangalore  [12.9345782537974, 77.6255145433083]   \n",
       "4    Bangalore  bangalore            [12.97030241, 77.63259485]   \n",
       "..         ...        ...                                   ...   \n",
       "195  Bangalore  bangalore                [12.970216, 77.644605]   \n",
       "196  Bangalore  bangalore             [12.9129109, 77.68027924]   \n",
       "197  Bangalore  bangalore              [12.8921763, 77.5981881]   \n",
       "198  Bangalore  bangalore            [12.92394946, 77.57651479]   \n",
       "199  Bangalore  bangalore                [12.971498, 77.600766]   \n",
       "\n",
       "                    cuisines    ids          locality  \\\n",
       "0           [Sweets, Snacks]    218  Old Airport Road   \n",
       "1    [American, Continental]    223       Koramangala   \n",
       "2          [Biryani, Andhra]    229       Koramangala   \n",
       "3                 [American]    232       Koramangala   \n",
       "4         [Chinese, Seafood]    246       Indiranagar   \n",
       "..                       ...    ...               ...   \n",
       "195    [Ice Cream, Desserts]  29668       Indiranagar   \n",
       "196    [Ice Cream, Desserts]  29670     Sarjapur Road   \n",
       "197    [Ice Cream, Desserts]  29671    Pandurangnagar   \n",
       "198    [Ice Cream, Desserts]  29672         Jayanagar   \n",
       "199    [Ice Cream, Desserts]  29673    St. Marks Road   \n",
       "\n",
       "                          name  rating  \n",
       "0     Anand Sweets & Savouries     4.6  \n",
       "1                     Truffles     4.6  \n",
       "2                Meghana Foods     4.6  \n",
       "3    The Hole In The Wall Cafe     4.6  \n",
       "4                      Kim Lee     4.6  \n",
       "..                         ...     ...  \n",
       "195          Natural Ice Cream     4.8  \n",
       "196          Natural Ice Cream     4.8  \n",
       "197          Natural Ice Cream     4.8  \n",
       "198          Natural Ice Cream     4.8  \n",
       "199          Natural Ice Cream     4.8  \n",
       "\n",
       "[200 rows x 11 columns]"
      ]
     },
     "execution_count": 84,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_query = \"\"\"\n",
    "MATCH (:City {ids: 'relation:7902476'})-[*3]->(obj:Restaurant)\n",
    "WHERE obj.rating > 4.5\n",
    "RETURN DISTINCT properties(obj) AS obj_props\n",
    "ORDER BY obj_props.ids ASC\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "result = graph.query(graph_query).result_set\n",
    "df = pd.DataFrame(data=[row[0] for row in result], columns=result[0][0].keys())\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time taken for graph query: 247.40 ms\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Restautant</th>\n",
       "      <th>Name</th>\n",
       "      <th>Type</th>\n",
       "      <th>Price</th>\n",
       "      <th>Rating</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bamey's Restro Cafe</td>\n",
       "      <td>Paneer Chilly</td>\n",
       "      <td>VEG</td>\n",
       "      <td>315.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Momo Rice Noodles</td>\n",
       "      <td>Fish Manchurian Gravy</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>370.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Momo Rice Noodles</td>\n",
       "      <td>Veg Chilli Garlic Curry with Rice</td>\n",
       "      <td>VEG</td>\n",
       "      <td>250.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Momo Rice Noodles</td>\n",
       "      <td>Chilli Crispy Fish Dry</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>370.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Momo Rice Noodles</td>\n",
       "      <td>Spicy Curd Chicken Lollipop ( 6 pic)</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>331.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Momo Rice Noodles</td>\n",
       "      <td>Veg Butter Garlic Noodles</td>\n",
       "      <td>VEG</td>\n",
       "      <td>225.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Beijing Bites</td>\n",
       "      <td>Hunan Tofu</td>\n",
       "      <td>VEG</td>\n",
       "      <td>299.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Momo Rice Noodles</td>\n",
       "      <td>Pork Schezwan Fried Rice</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>290.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Momo Rice Noodles</td>\n",
       "      <td>Seafood Mushroom Clear Soup</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>195.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Thai Basil</td>\n",
       "      <td>Stir Fried Chicken Red Curry Paste</td>\n",
       "      <td>NONVEG</td>\n",
       "      <td>480.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Restautant                                  Name    Type  Price  \\\n",
       "0  Bamey's Restro Cafe                         Paneer Chilly     VEG  315.0   \n",
       "1    Momo Rice Noodles                 Fish Manchurian Gravy  NONVEG  370.0   \n",
       "2    Momo Rice Noodles     Veg Chilli Garlic Curry with Rice     VEG  250.0   \n",
       "3    Momo Rice Noodles                Chilli Crispy Fish Dry  NONVEG  370.0   \n",
       "4    Momo Rice Noodles  Spicy Curd Chicken Lollipop ( 6 pic)  NONVEG  331.0   \n",
       "5    Momo Rice Noodles             Veg Butter Garlic Noodles     VEG  225.0   \n",
       "6        Beijing Bites                            Hunan Tofu     VEG  299.0   \n",
       "7    Momo Rice Noodles              Pork Schezwan Fried Rice  NONVEG  290.0   \n",
       "8    Momo Rice Noodles           Seafood Mushroom Clear Soup  NONVEG  195.0   \n",
       "9           Thai Basil    Stir Fried Chicken Red Curry Paste  NONVEG  480.0   \n",
       "\n",
       "   Rating  \n",
       "0     5.0  \n",
       "1     5.0  \n",
       "2     5.0  \n",
       "3     5.0  \n",
       "4     5.0  \n",
       "5     5.0  \n",
       "6     5.0  \n",
       "7     5.0  \n",
       "8     5.0  \n",
       "9     5.0  "
      ]
     },
     "execution_count": 114,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get best rated menus from best rated restaurants serving thai cuisines in Koramangala\n",
    "from time import time\n",
    "\n",
    "\n",
    "graph_query = \"\"\"\n",
    "MATCH (:Area {name: 'Koramangala'})-[*2]->(rstn:Restaurant)-[]->(:MainCuisine {name: 'Thai'})\n",
    "WHERE rstn.rating > 4.0\n",
    "MATCH (rstn)-[link:HAS_MENU]-(menu:Menu)\n",
    "WHERE link.rating > 4.0\n",
    "RETURN DISTINCT\n",
    "    rstn.name,\n",
    "    menu.name,\n",
    "    menu.types,\n",
    "    link.price,\n",
    "    link.rating\n",
    "ORDER BY link.rating DESC\n",
    "LIMIT 2000\n",
    "\"\"\"\n",
    "st = time()\n",
    "result = graph.query(graph_query).result_set\n",
    "print(f\"Time taken for graph query: {(time() - st)*1000:.2f} ms\")\n",
    "df = pd.DataFrame([row for row in result], columns=['Restautant','Name', 'Type', 'Price', 'Rating'])\n",
    "\n",
    "\n",
    "df.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "id": "0a05a140",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(683, 5)"
      ]
     },
     "execution_count": 102,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 205,
   "id": "f138ca92",
   "metadata": {},
   "outputs": [],
   "source": [
    "from typing import Literal, Dict, Any, List\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 208,
   "id": "7e712430",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_competitors(\n",
    "    q_params: dict,\n",
    "    output: Literal['dict', 'dataframe'] = 'dict',\n",
    "    exclude: List[str]=[\"ids\", \"city_id\"],\n",
    ") -> List[Dict[str, Any]] | pd.DataFrame:\n",
    "    graph_query = \"\"\"\n",
    "    MATCH (:Area {name: $area})-[:HAS_LOCALITY]->(:Locality)-[:HAS_RESTAURANT]->(r:Restaurant)\n",
    "    MATCH (r)-[:SERVES_MAIN_CUISINE]->(:MainCuisine {name: $cuisine})\n",
    "    WHERE r.rating IS NOT NULL AND r.rating >= $min_rating\n",
    "    RETURN DISTINCT r\n",
    "    ORDER BY r.rating DESC, r.name ASC\n",
    "    LIMIT $limit\n",
    "    \"\"\"\n",
    "    result = graph.query(graph_query, q_params).result_set\n",
    "    rqrd_data = [\n",
    "        {\n",
    "            key: ', '.join([str(item) for item in val]) if isinstance(val, list) else val\n",
    "            for key, val in res[0].properties.items() \n",
    "            if key not in exclude\n",
    "        }\n",
    "        for res in result\n",
    "    ]\n",
    "    # include query time in logs\n",
    "    return pd.DataFrame(rqrd_data) if output=='dataframe' else rqrd_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 209,
   "id": "5f48d09d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>city</th>\n",
       "      <th>area</th>\n",
       "      <th>locality</th>\n",
       "      <th>cuisines</th>\n",
       "      <th>rating</th>\n",
       "      <th>address</th>\n",
       "      <th>coords</th>\n",
       "      <th>chain</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Thai Basil</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Thai</td>\n",
       "      <td>4.6</td>\n",
       "      <td>840/A/1 Indiranagar 100Ft Road 560038</td>\n",
       "      <td>12.9806363, 77.6407933</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SHARON TEA STALL</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Thai, Bakery</td>\n",
       "      <td>4.5</td>\n",
       "      <td>Shop No : 1 , Floor : G , SHARON TEA STALL , N...</td>\n",
       "      <td>12.9731234486116, 77.6471368762574</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Xian</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Sarvagna Nagar</td>\n",
       "      <td>Chinese, Thai</td>\n",
       "      <td>4.5</td>\n",
       "      <td># 11,Haudin Road, Diagonally opp God's Gift Ap...</td>\n",
       "      <td>12.961136, 77.635647</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Beijing Bites</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>CMH Road</td>\n",
       "      <td>Chinese, Thai</td>\n",
       "      <td>4.4</td>\n",
       "      <td>537/2, CMH Road, Indiranagar, Bangalore</td>\n",
       "      <td>12.977945, 77.638814</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Tiger Thai</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>100 feet road</td>\n",
       "      <td>Thai, Pan-Asian</td>\n",
       "      <td>4.4</td>\n",
       "      <td>No.656, TAIKI, 100 FEET ROAD , INDIRANGAR , BA...</td>\n",
       "      <td>12.9769721, 77.6406962</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Wok In Chow - Pure Vegetarian Asian Street Food</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Appareddipalya</td>\n",
       "      <td>Chinese, Thai</td>\n",
       "      <td>4.4</td>\n",
       "      <td>XJCP+4CG, 11th Main Rd, Appareddipalya, Indira...</td>\n",
       "      <td>12.970307402356, 77.636133347885</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>China Garten</td>\n",
       "      <td>Bangalore</td>\n",
       "      <td>Indiranagar</td>\n",
       "      <td>Hal 2dd Stage</td>\n",
       "      <td>Chinese, Thai</td>\n",
       "      <td>4.3</td>\n",
       "      <td>No 82 ground floor vasanthappa garden 13th g m...</td>\n",
       "      <td>12.965888, 77.639993</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              name       city         area  \\\n",
       "0                                       Thai Basil  Bangalore  Indiranagar   \n",
       "1                                 SHARON TEA STALL  Bangalore  Indiranagar   \n",
       "2                                             Xian  Bangalore  Indiranagar   \n",
       "3                                    Beijing Bites  Bangalore  Indiranagar   \n",
       "4                                       Tiger Thai  Bangalore  Indiranagar   \n",
       "5  Wok In Chow - Pure Vegetarian Asian Street Food  Bangalore  Indiranagar   \n",
       "6                                     China Garten  Bangalore  Indiranagar   \n",
       "\n",
       "         locality         cuisines  rating  \\\n",
       "0     Indiranagar             Thai     4.6   \n",
       "1     Indiranagar     Thai, Bakery     4.5   \n",
       "2  Sarvagna Nagar    Chinese, Thai     4.5   \n",
       "3        CMH Road    Chinese, Thai     4.4   \n",
       "4   100 feet road  Thai, Pan-Asian     4.4   \n",
       "5  Appareddipalya    Chinese, Thai     4.4   \n",
       "6   Hal 2dd Stage    Chinese, Thai     4.3   \n",
       "\n",
       "                                             address  \\\n",
       "0              840/A/1 Indiranagar 100Ft Road 560038   \n",
       "1  Shop No : 1 , Floor : G , SHARON TEA STALL , N...   \n",
       "2  # 11,Haudin Road, Diagonally opp God's Gift Ap...   \n",
       "3            537/2, CMH Road, Indiranagar, Bangalore   \n",
       "4  No.656, TAIKI, 100 FEET ROAD , INDIRANGAR , BA...   \n",
       "5  XJCP+4CG, 11th Main Rd, Appareddipalya, Indira...   \n",
       "6  No 82 ground floor vasanthappa garden 13th g m...   \n",
       "\n",
       "                               coords  chain  \n",
       "0              12.9806363, 77.6407933   True  \n",
       "1  12.9731234486116, 77.6471368762574   True  \n",
       "2                12.961136, 77.635647  False  \n",
       "3                12.977945, 77.638814   True  \n",
       "4              12.9769721, 77.6406962  False  \n",
       "5    12.970307402356, 77.636133347885  False  \n",
       "6                12.965888, 77.639993  False  "
      ]
     },
     "execution_count": 209,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from src.RAG.Config.tool_models import GetCompetitorModels\n",
    "\n",
    "f_params = GetCompetitorModels.FunctionParams(\n",
    "    q_params=GetCompetitorModels.QueryParams(\n",
    "        area='Indiranagar',\n",
    "        cuisine='Thai',\n",
    "        limit=200,\n",
    "    ),\n",
    "    output='dataframe',\n",
    "    exclude=['ids','city_id'],\n",
    ")\n",
    "cmpt_data = get_competitors(**f_params.model_dump())\n",
    "cmpt_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "709168a3",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
